-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        8.0.35 - MySQL Community Server - GPL
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  12.6.0.6765
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


-- jboard 데이터베이스 구조 내보내기
DROP DATABASE IF EXISTS `jboard`;
CREATE DATABASE IF NOT EXISTS `jboard` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `jboard`;

-- 테이블 jboard.article 구조 내보내기
DROP TABLE IF EXISTS `article`;
CREATE TABLE IF NOT EXISTS `article` (
  `no` int NOT NULL AUTO_INCREMENT,
  `parent` int DEFAULT '0',
  `comment` int DEFAULT '0',
  `cate` varchar(20) DEFAULT 'free',
  `title` varchar(100) DEFAULT NULL,
  `content` text NOT NULL,
  `file` int NOT NULL,
  `hit` int DEFAULT '0',
  `writer` varchar(20) NOT NULL,
  `regip` varchar(50) NOT NULL,
  `rdate` datetime(6) DEFAULT NULL,
  `nick` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`no`),
  KEY `writer` (`writer`),
  CONSTRAINT `article_ibfk_1` FOREIGN KEY (`writer`) REFERENCES `user` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=1658 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 jboard.article:~224 rows (대략적) 내보내기
DELETE FROM `article`;
INSERT INTO `article` (`no`, `parent`, `comment`, `cate`, `title`, `content`, `file`, `hit`, `writer`, `regip`, `rdate`, `nick`) VALUES
	(1157, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1158, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1159, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1164, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1165, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1166, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1168, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1175, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1176, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1177, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1182, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1183, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1184, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1186, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1188, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1189, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1190, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1195, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1196, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1197, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1199, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1201, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1202, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1203, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1208, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1209, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1210, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1212, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1214, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1215, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1216, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1221, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1275, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1373, 0, 0, 'free', '파일삭제를 위한', '파일 삭제를 위한', 1, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-29 14:28:59.000000', NULL),
	(1374, 1327, 0, 'free', NULL, '동적 태그 삭제', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-29 15:17:17.000000', NULL),
	(1375, 0, 0, 'free', 'test123', 'test123456', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-19 18:09:01.226571', NULL),
	(1376, 0, 0, 'notice', 'test1234', 'test11', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:00:01.375822', NULL),
	(1377, 0, 0, '', 'test1234', 'test11', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:00:12.607692', NULL),
	(1378, 0, 0, 'notice', 'test1234', 'test123', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:02:05.183962', NULL),
	(1379, 0, 0, 'notice', 'test1111', 'test111111111', 1, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:59:16.400652', NULL),
	(1380, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1381, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1382, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1383, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1384, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1385, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1386, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1387, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1388, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1389, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1390, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1391, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1392, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1393, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1394, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1395, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1396, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1397, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1398, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1399, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1400, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1401, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1402, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1403, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1404, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1405, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1406, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1407, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1408, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1409, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1410, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1411, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1412, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1413, 0, 0, 'free', '파일삭제를 위한', '파일 삭제를 위한', 1, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-29 14:28:59.000000', NULL),
	(1414, 0, 0, 'free', NULL, '동적 태그 삭제', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-29 15:17:17.000000', NULL),
	(1415, 0, 0, 'free', 'test123', 'test123456', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-19 18:09:01.226571', NULL),
	(1416, 0, 0, 'notice', 'test1234', 'test11', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:00:01.375822', NULL),
	(1417, 0, 0, '', 'test1234', 'test11', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:00:12.607692', NULL),
	(1418, 0, 0, 'notice', 'test1234', 'test123', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:02:05.183962', NULL),
	(1419, 0, 0, 'notice', 'test1111', 'test111111111', 1, 2, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:59:16.400652', NULL),
	(1443, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1444, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1445, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1446, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1447, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1448, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1449, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1450, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1451, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1452, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1453, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1454, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1455, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1456, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1457, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1458, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1459, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1460, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1461, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1462, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1463, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1464, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1465, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1466, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1467, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1468, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1469, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1470, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1471, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1472, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1473, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1474, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1475, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1476, 0, 0, 'free', '파일삭제를 위한', '파일 삭제를 위한', 1, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-29 14:28:59.000000', NULL),
	(1477, 0, 0, 'free', NULL, '동적 태그 삭제', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-29 15:17:17.000000', NULL),
	(1478, 0, 0, 'free', 'test123', 'test123456', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-19 18:09:01.226571', NULL),
	(1479, 0, 0, 'notice', 'test1234', 'test11', 0, 6, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:00:01.375822', NULL),
	(1480, 0, 0, '', 'test1234', 'test11', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:00:12.607692', NULL),
	(1481, 0, 0, 'notice', 'test1234', 'test123', 0, 1, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:02:05.183962', NULL),
	(1482, 0, 0, 'notice', 'test1111', 'test111111111', 1, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:59:16.400652', NULL),
	(1483, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1484, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1485, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1486, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1487, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1488, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1489, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1490, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1491, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1492, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1493, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1494, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1495, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1496, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1497, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1498, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1499, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1500, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1501, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1502, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1503, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1504, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1505, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1506, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1507, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1508, 0, 0, 'free', '포도입니다.', '포도입니까?', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:45:10.000000', NULL),
	(1509, 0, 0, 'free', '바나나입니다.', '바나나 포도 수박', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:48:04.000000', NULL),
	(1510, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1511, 0, 0, 'free', '첫번째 test', 'test1234\r\n\r\n수정???', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1512, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1513, 0, 0, 'free', '첫번째 test', 'test1234', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-07 09:52:35.000000', NULL),
	(1514, 0, 0, 'free', '사과', '사과입니다.', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-14 09:37:54.000000', NULL),
	(1515, 0, 0, 'free', '새로운 글입니다.', '포도, 사과, 당근 당근', 0, 0, 'ab12', '0:0:0:0:0:0:0:1', '2024-02-14 11:03:49.000000', NULL),
	(1516, 0, 0, 'free', '파일삭제를 위한', '파일 삭제를 위한', 1, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-29 14:28:59.000000', NULL),
	(1517, 0, 0, 'free', NULL, '동적 태그 삭제', 0, 0, 'a101', '0:0:0:0:0:0:0:1', '2024-02-29 15:17:17.000000', NULL),
	(1518, 0, 0, 'free', 'test123', 'test123456', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-19 18:09:01.226571', NULL),
	(1519, 0, 0, 'notice', 'test1234', 'test11', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:00:01.375822', NULL),
	(1520, 0, 0, '', 'test1234', 'test11', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:00:12.607692', NULL),
	(1521, 0, 0, 'notice', 'test1234', 'test123', 0, 2, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:02:05.183962', NULL),
	(1522, 0, 0, 'notice', 'test1111', 'test111111111', 1, 6, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 10:59:16.400652', NULL),
	(1570, 0, 0, '', '파일 첨부합ㄴ디ㅏ.', '파일 첨부', 3, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 16:17:04.440751', NULL),
	(1571, 0, 0, '', '파일 다시 올려여', '왜 하나만 들어가지>?', 3, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 16:49:23.775080', NULL),
	(1572, 0, 0, '', 't1234', 'tes왜\r\n!!!1어째서 ', 3, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 17:01:24.585774', NULL),
	(1573, 0, 0, '', 't1234', 'tes왜\r\n!!!1어째서 ', 3, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 17:13:25.833458', NULL),
	(1574, 0, 0, '', '이제는 꼭 되기를.....', '식별자 값에 ai넣었따.', 3, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-20 17:14:44.759891', NULL),
	(1575, 0, 0, 'qna', '너의 파일첨부는?', '파일첨부합니다.', 1, 8, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-25 12:34:24.661382', NULL),
	(1576, 1518, 0, NULL, NULL, '12346', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-21 11:33:33.630826', NULL),
	(1577, 1513, 0, NULL, NULL, '댓글 없어 등록해봐봐', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-21 12:12:54.529013', NULL),
	(1578, 1513, 0, NULL, NULL, '다시 한번 더 등록 해봐봐 15313', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-21 12:13:07.544011', NULL),
	(1579, 1522, 0, NULL, NULL, '댓글을 달아보자', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-21 12:15:31.565839', NULL),
	(1580, 1419, 0, NULL, NULL, '댓글 다시 달아보자', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-21 12:17:16.440025', NULL),
	(1581, 1419, 0, NULL, NULL, '한번 더 ', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-21 12:17:27.198941', NULL),
	(1582, 1518, 0, NULL, NULL, '이것입니까?', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-21 12:32:33.739677', NULL),
	(1585, 0, 0, 'free', '글을 쓰고 있습니다.', '글쓰기 기능구현을 보여드리고 있습니다.', 0, 5, 'a101', '0:0:0:0:0:0:0:1', '2024-03-22 09:37:53.000000', NULL),
	(1586, 0, 0, 'free', '파일 첨부 기능 구현', '파일 첨부 기능을 구현하고 있습니다.', 0, 2, 'a101', '127.0.0.1', '2024-03-25 11:07:16.868611', NULL),
	(1587, 1586, 0, NULL, NULL, '댓글1', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-22 10:11:21.986887', NULL),
	(1588, 1586, 0, NULL, NULL, '댓글2', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-22 10:11:25.277847', NULL),
	(1589, 1586, 0, NULL, NULL, '댓글3', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-22 10:11:28.280613', NULL),
	(1590, 1586, 0, NULL, NULL, '댓글4', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-22 10:11:30.641153', NULL),
	(1591, 1586, 0, NULL, NULL, '댓글5', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-22 10:11:33.299454', NULL),
	(1592, 1586, 0, NULL, NULL, '한번 더 수정이 되나요?', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 12:29:22.653164', NULL),
	(1593, 0, 0, 'free', '글이수정되니?', 'rdate도 수정이 잘 되니?', 0, 2, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-25 11:06:02.092836', NULL),
	(1594, 0, 0, 'feq', '여기도 글 하나 수정해보자', '여기도 글수정', 0, 5, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-25 11:29:54.129546', NULL),
	(1595, 0, 0, 'notice', '3', '', 0, 10, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-22 10:59:56.431767', NULL),
	(1596, 1593, 0, NULL, NULL, '댓글입력쓰', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-22 11:12:17.364583', NULL),
	(1597, 1593, 0, NULL, NULL, '한번더 입력쓰', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-22 11:13:02.204585', NULL),
	(1598, 0, 0, 'free', '파일 첨부', '파일 첨부', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-25 11:20:32.193778', NULL),
	(1599, 0, 0, 'free', '첨부', '첨부파일', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-25 11:23:24.828819', NULL),
	(1600, 0, 0, 'free', '첨부쓰', '첨부', 0, 1, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-25 11:23:48.126344', NULL),
	(1601, 0, 0, 'free', '첨부하자', '첨부', 0, 2, 'sois92', '127.0.0.1', '2024-03-25 11:24:50.662670', NULL),
	(1602, 0, 0, 'free', '첨', '첨부', 2, 30, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-25 11:29:22.385966', NULL),
	(1603, 0, 0, 'feq', '첨부도 수정', '첨부도 수정해보자', 1, 2, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-25 12:27:18.737109', NULL),
	(1605, 1602, 0, NULL, NULL, '댓글쓰', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 12:29:17.109620', NULL),
	(1606, 1602, 0, NULL, NULL, '이건왜', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 12:29:22.653164', NULL),
	(1607, 1595, 0, NULL, NULL, '댓글쓰기 수정', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 12:29:22.653164', NULL),
	(1608, 1595, 0, NULL, NULL, '두번째 쓰기', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 12:31:43.741476', NULL),
	(1610, 1601, 0, NULL, NULL, 'ㅊㅍㅋㅊㅍ', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 12:33:06.124685', NULL),
	(1611, 1601, 0, NULL, NULL, '211ㅇㄹ354ㅇㄹ', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 12:33:09.958583', NULL),
	(1612, 1602, 0, NULL, NULL, '댓글입력1-5', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 17:41:47.727379', NULL),
	(1613, 1602, 0, NULL, NULL, '댓글입력2-3', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 12:29:22.653164', NULL),
	(1614, 1602, 0, NULL, NULL, '댓글입력3-3', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 12:29:22.653164', NULL),
	(1615, 1575, 0, NULL, NULL, '댓글입력', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 12:42:28.829487', NULL),
	(1617, 1602, 0, NULL, NULL, '새로 댓글 이제 날짜 안 날라간다.', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 17:40:00.990849', NULL),
	(1618, 0, 0, '', '테스트1', '테스트1', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:27:39.426304', NULL),
	(1619, 0, 0, '', 'test1', 'test123', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:28:10.634040', NULL),
	(1620, 0, 0, '', 'asdf', 'asdf', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:30:26.989109', NULL),
	(1624, 0, 0, '', '1234', '5679', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:34:56.871524', NULL),
	(1625, 0, 0, 'free', '글쓰기 테스트', '1234567', 0, 1, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:47:02.294459', NULL),
	(1626, 0, 0, 'feq', '일단 이거 해보자', '이거 맞나?', 0, 2, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:47:42.400114', NULL),
	(1627, 0, 0, 'feq', '12349', '234567', 0, 2, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:50:44.284354', NULL),
	(1628, 0, 0, 'free', '글쓰기', '글쓰기', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:53:14.178511', NULL),
	(1629, 0, 0, 'free', '', '', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:53:31.740943', NULL),
	(1630, 0, 0, 'free', '글쓰기', '글써보자', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:56:12.915062', NULL),
	(1631, 0, 0, 'notice', '글을 써보자꾸나', '글써보기', 0, 1, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:56:52.319789', NULL),
	(1632, 0, 0, 'free', '글을 써봅니다.!!!!!!', '글 쓰기의 위엄!!!!', 0, 1, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 18:58:59.468948', NULL),
	(1633, 0, 0, 'notice', 'ㅁㅇㄹ', 'ㅁㅇㄹ', 0, 5, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 19:00:45.069407', NULL),
	(1634, 0, 0, 'feq', 'adf', 'asdf', 0, 3, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 19:01:17.414204', NULL),
	(1635, 0, 0, 'free', '글을 써봅니다.', '글쓰기', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 19:01:46.134793', NULL),
	(1636, 0, 0, 'free', 'asd', 'asdf', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 19:02:57.517662', NULL),
	(1637, 1633, 0, NULL, NULL, '댓글을 달아드릴께요-수정', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 19:05:29.499307', NULL),
	(1638, 0, 0, 'free', '123', 'ddddd', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-26 19:08:04.318798', NULL),
	(1639, 0, 0, 'free', '글을 쓰고 넣어보자', '글쓰기완료?', 0, 3, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 15:01:28.200240', NULL),
	(1640, 0, 0, 'notice', '글을 써보자꾸나', '글을 써보자', 0, 1, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 15:41:57.390569', NULL),
	(1641, 0, 0, 'feq', '글쓰기', '글쓰기', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 15:43:23.040956', NULL),
	(1642, 0, 0, 'free', '제목test', '내용 test', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 17:39:00.904166', NULL),
	(1643, 0, 0, '', '설마.. ', '두근 설마...', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 18:06:03.994227', NULL),
	(1644, 0, 0, '', '설마..', '설마...', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 18:07:20.305476', NULL),
	(1645, 0, 0, '', '글써보기', '글 써보기', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 18:08:02.933034', NULL),
	(1646, 0, 0, '', 'ㅇㅁㄹ', 'ㅁㄴㅇㄹ', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 18:12:35.892156', NULL),
	(1647, 0, 0, '', 'fad', 'afd', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 18:17:27.992386', NULL),
	(1648, 0, 0, '', 'cv', 'dcvfd', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 18:25:27.039928', NULL),
	(1649, 0, 0, '', 'hgh', 'gggg', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 18:30:22.168177', NULL),
	(1650, 0, 0, '', 'trrrrrrrrrr', 'rrrrrrrrrrrrrrrrrrrrrr', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 18:36:52.730793', NULL),
	(1651, 0, 0, '', 'adfa', 'adf', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 18:41:45.267868', NULL),
	(1652, 0, 0, '', 'xccxC', 'zxcZx', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-27 18:49:54.325700', NULL),
	(1653, 0, 0, 'free', 'asdfa', 'asdf', 0, 1, 'sois92', '127.0.0.1', '2024-03-27 18:53:40.384100', NULL),
	(1654, 0, 0, 'qna', '글을 써봅니다.', '글을 써보자. 첨부도', 1, 1, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-28 15:15:22.300198', NULL),
	(1655, 0, 0, 'qna', '글을 써보자', '글을 써보다', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-28 15:15:33.616564', NULL),
	(1657, 1653, 0, NULL, NULL, '이것도 달아보자', 0, 0, 'sois92', '0:0:0:0:0:0:0:1', '2024-03-28 15:16:12.390714', NULL);

-- 테이블 jboard.config 구조 내보내기
DROP TABLE IF EXISTS `config`;
CREATE TABLE IF NOT EXISTS `config` (
  `cate` varchar(255) NOT NULL,
  `admin` varchar(255) DEFAULT NULL,
  `boardName` varchar(255) DEFAULT NULL,
  `createDate` datetime(6) DEFAULT NULL,
  `total` int NOT NULL DEFAULT '0',
  PRIMARY KEY (`cate`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 jboard.config:~4 rows (대략적) 내보내기
DELETE FROM `config`;
INSERT INTO `config` (`cate`, `admin`, `boardName`, `createDate`, `total`) VALUES
	('feq', 'sois92', '자주묻는 질문', '2024-03-19 00:00:00.000000', 0),
	('free', 'sois92', '자유게시판', '2024-03-19 00:00:00.000000', 0),
	('notice', 'sois92', '공지사항', '2024-03-19 00:00:00.000000', 0),
	('qna', 'sois92', '묻고답하기', '2024-03-19 00:00:00.000000', 0);

-- 테이블 jboard.file 구조 내보내기
DROP TABLE IF EXISTS `file`;
CREATE TABLE IF NOT EXISTS `file` (
  `fno` int NOT NULL AUTO_INCREMENT,
  `ano` int NOT NULL,
  `oName` varchar(100) NOT NULL,
  `sName` varchar(100) NOT NULL,
  `download` int DEFAULT '0',
  `rdate` datetime NOT NULL,
  `article_no` int DEFAULT NULL,
  PRIMARY KEY (`fno`),
  KEY `ano` (`ano`),
  KEY `FKb096kkd696shg4g2iqxndfs3l` (`article_no`),
  CONSTRAINT `file_ibfk_1` FOREIGN KEY (`ano`) REFERENCES `article` (`no`),
  CONSTRAINT `FKb096kkd696shg4g2iqxndfs3l` FOREIGN KEY (`article_no`) REFERENCES `article` (`no`)
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 jboard.file:~27 rows (대략적) 내보내기
DELETE FROM `file`;
INSERT INTO `file` (`fno`, `ano`, `oName`, `sName`, `download`, `rdate`, `article_no`) VALUES
	(2, 1373, '리눅스 설정.txt', '3a9b2ad4-c3ba-4455-8dc3-a1e960c65671.txt', 0, '2024-02-29 14:28:59', NULL),
	(3, 1379, '이전코드.txt', '265c8b8c-16d5-46e1-ae4e-5c256ba493dd.txt', 0, '2024-03-20 10:59:16', NULL),
	(4, 1570, '아마존 비번...txt', '0f318bca-b8cb-4d4c-bf7f-c724fd89638a.txt', 0, '2024-03-20 16:17:04', NULL),
	(5, 1571, '내가짠코드.txt', '53266bea-3900-496f-ba76-68bfec739978.txt', 0, '2024-03-20 16:49:24', NULL),
	(6, 1572, '앱비밀번호.txt', '7d93f517-ade1-446a-b5a4-ded2f86c8e70.txt', 0, '2024-03-20 17:01:25', NULL),
	(7, 1573, '앱비밀번호.txt', '0ff8e92d-6884-4287-8c18-46c1ca7214d2.txt', 0, '2024-03-20 17:13:26', NULL),
	(8, 1573, '우리조.txt', '28365571-a3df-403f-82e8-ed301bcc6036.txt', 0, '2024-03-20 17:13:26', NULL),
	(9, 1573, '이전코드.txt', '95c32313-589d-4b2d-ab4a-b56a1a3eaa43.txt', 0, '2024-03-20 17:13:26', NULL),
	(10, 1574, '내코드(완).txt', '91c4b091-fec7-4d42-a2d0-07c93995481a.txt', 0, '2024-03-20 17:14:45', NULL),
	(11, 1574, '아마존 비번...txt', '6a81834f-5363-4255-96f6-1843e68851c1.txt', 0, '2024-03-20 17:14:45', NULL),
	(12, 1574, '앱비밀번호.txt', '2d1c6b65-739e-4c4e-9165-b94724629001.txt', 0, '2024-03-20 17:14:45', NULL),
	(13, 1575, '내가짠코드.txt', 'cfe1a576-fb76-4053-9e73-830d4cbdf3c7.txt', 6, '2024-03-20 17:24:50', NULL),
	(14, 1575, '내코드(완).txt', 'bf059ec8-afc3-40da-9f4e-6b729ed75ab2.txt', 3, '2024-03-20 17:24:50', NULL),
	(15, 1575, '이전코드.txt', 'dd91a6c3-3dae-4b0e-a6bb-8936dea86b3f.txt', 5, '2024-03-20 17:24:50', NULL),
	(16, 1586, '내 코드였던것.txt', 'a0af59dd-426f-4092-885d-979ddd6336a4.txt', 3, '2024-03-22 09:40:30', NULL),
	(17, 1586, '우리조.txt', '120bda13-635f-4e1d-9f79-be65116b213d.txt', 0, '2024-03-22 09:40:30', NULL),
	(18, 1598, '우리조.txt', '5efd88d3-d0f5-4375-8e12-94c2ac02cef1.txt', 0, '2024-03-25 11:08:48', NULL),
	(19, 1598, '하이디sql.txt', '5ebc37b2-d06b-48d7-abc8-6eca618e0408.txt', 0, '2024-03-25 11:08:48', NULL),
	(20, 1599, '앱비밀번호.txt', 'f9569a94-a04b-42d0-851c-d195ea24c63b.txt', 0, '2024-03-25 11:23:15', NULL),
	(21, 1599, '우리조.txt', '160950b0-4da1-4ec4-a6ae-67dffaa2de34.txt', 0, '2024-03-25 11:23:15', NULL),
	(22, 1601, '앱비밀번호.txt', '21837e95-3a96-41f9-ae97-45f4a9b9df71.txt', 0, '2024-03-25 11:24:39', NULL),
	(23, 1601, '우리조.txt', '3d52ca5b-899e-4b15-934d-7abf7516b2df.txt', 0, '2024-03-25 11:24:39', NULL),
	(24, 1602, '앱비밀번호.txt', '6ab29326-0013-453f-92c2-64d6af968e05.txt', 0, '2024-03-25 11:29:22', NULL),
	(25, 1602, '우리조.txt', '7437657b-492d-4874-81e2-8e7854360990.txt', 0, '2024-03-25 11:29:22', NULL),
	(26, 1603, 'CSS선생님화면.txt', 'f4ff842c-03fc-4267-811f-23d0ee7864be.txt', 1, '2024-03-25 11:31:49', NULL),
	(27, 1603, '오늘의 메모.txt', 'df4bc6ce-e524-4bb5-a3ee-399b971af041.txt', 1, '2024-03-25 12:16:50', NULL),
	(28, 1575, '오늘의 메모.txt', '05e1a6eb-b061-49d5-8ba5-8b157ceb2765.txt', 0, '2024-03-25 12:27:02', NULL),
	(29, 1603, '아마존 비번...txt', '12a51e8d-e6e5-4a4d-8f20-d639cae665da.txt', 0, '2024-03-25 12:27:19', NULL),
	(30, 1575, '게시판 이슈.txt', 'd46327f0-45bb-4003-94d8-38c717ace524.txt', 0, '2024-03-25 12:34:25', NULL),
	(31, 1654, '배포하는법(war).txt', '53ea0a09-75db-49e4-b39e-eae6e817f8f9.txt', 0, '2024-03-28 15:15:22', NULL);

-- 테이블 jboard.terms 구조 내보내기
DROP TABLE IF EXISTS `terms`;
CREATE TABLE IF NOT EXISTS `terms` (
  `terms` text,
  `privacy` text,
  `sms` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 jboard.terms:~1 rows (대략적) 내보내기
DELETE FROM `terms`;
INSERT INTO `terms` (`terms`, `privacy`, `sms`) VALUES
	('여러분을 환영합니다.\r\n네이버 서비스 및 제품(이하 ‘서비스’)을 이용해 주셔서 감사합니다. 본 약관은 다양한 네이버 서비스의 이용과 관련하여 네이버 서비스를 제공하는 네이버 주식회사(이하 ‘네이버’)와 이를 이용하는 네이버 서비스 회원(이하 ‘회원’) 또는 비회원과의 관계를 설명하며, 아울러 여러분의 네이버 서비스 이용에 도움이 될 수 있는 유익한 정보를 포함하고 있습니다.\r\n\r\n네이버 서비스를 이용하시거나 네이버 서비스 회원으로 가입하실 경우 여러분은 본 약관 및 관련 운영 정책을 확인하거나 동의하게 되므로, 잠시 시간을 내시어 주의 깊게 살펴봐 주시기 바랍니다.\r\n\r\n다양한 네이버 서비스를 즐겨보세요.\r\n네이버는 www.naver.com을 비롯한 네이버 도메인의 웹사이트 및 응용프로그램(어플리케이션, 앱)을 통해 정보 검색, 다른 이용자와의 커뮤니케이션, 콘텐츠 제공, 상품 쇼핑 등 여러분의 생활에 편리함을 더할 수 있는 다양한 서비스를 제공하고 있습니다.\r\n여러분은 PC, 휴대폰 등 인터넷 이용이 가능한 각종 단말기를 통해 각양각색의 네이버 서비스를 자유롭게 이용하실 수 있으며, 개별 서비스들의 구체적인 내용은 각 서비스 상의 안내, 공지사항, 네이버 웹고객센터(이하 ‘고객센터’) 도움말 등에서 쉽게 확인하실 수 있습니다.\r\n\r\n네이버는 기본적으로 여러분 모두에게 동일한 내용의 서비스를 제공합니다. 다만, \'청소년보호법\' 등 관련 법령이나 기타 개별 서비스 제공에서의 특별한 필요에 의해서 연령 또는 일정한 등급을 기준으로 이용자를 구분하여 제공하는 서비스의 내용, 이용 시간, 이용 횟수 등을 다르게 하는 등 일부 이용을 제한하는 경우가 있습니다. 자세한 내용은 역시 각 서비스 상의 안내, 공지사항, 고객센터 도움말 등에서 확인하실 수 있습니다.\r\n\r\n네이버 서비스에는 기본적으로 본 약관이 적용됩니다만 네이버가 다양한 서비스를 제공하는 과정에서 부득이 본 약관 외 별도의 약관, 운영정책 등을 적용하는 경우(예, 네이버페이, V LIVE 등)가 있습니다. 그리고 네이버 계열사가 제공하는 특정 서비스의 경우에도(예, LINE, SNOW등) 해당 운영 회사가 정한 고유의 약관, 운영정책 등이 적용될 수 있습니다. 이러한 내용은 각각의 해당 서비스 초기 화면에서 확인해 주시기 바랍니다.\r\n\r\n회원으로 가입하시면 네이버 서비스를 보다 편리하게 이용할 수 있습니다.\r\n여러분은 본 약관을 읽고 동의하신 후 회원 가입을 신청하실 수 있으며, 네이버는 이에 대한 승낙을 통해 회원 가입 절차를 완료하고 여러분께 네이버 서비스 이용 계정(이하 ‘계정’)을 부여합니다. 계정이란 회원이 네이버 서비스에 로그인한 이후 이용하는 각종 서비스 이용 이력을 회원 별로 관리하기 위해 설정한 회원 식별 단위를 말합니다. 회원은 자신의 계정을 통해 좀더 다양한 네이버 서비스를 보다 편리하게 이용할 수 있습니다. 이와 관련한 상세한 내용은 계정 운영정책 및 고객센터 내 네이버 회원가입 방법 등에서 확인해 주세요.\r\n\r\n네이버는 단체에 속한 여러 구성원들이 공동의 계정으로 네이버 서비스를 함께 이용할 수 있도록 단체회원 계정도 부여하고 있습니다. 단체회원 구성원들은 하나의 계정 및 아이디(ID)를 공유하되 각자 개별적으로 설정한 비밀번호를 입력하여 계정에 로그인하고 각종 서비스를 이용하게 됩니다. 단체회원은 관리자와 멤버로 구성되며, 관리자는 구성원 전부로부터 권한을 위임 받아 단체회원을 대표하고 단체회원 계정을 운용합니다.\r\n따라서 관리자는 단체회원 계정을 통해 별도 약관 또는 기존 약관 개정에 대해 동의하거나 단체회원에서 탈퇴할 수 있고, 멤버들의 단체회원 계정 로그인 방법 및 이를 통한 게시물 게재 등 네이버 서비스 이용을 관리(게시물 삭제 포함)할 수 있습니다. 본 약관에서 규정한 사항은 원칙적으로 구성원 모두에게 적용되며, 각각의 구성원은 다른 구성원들의 단체회원 계정 및 아이디(ID)를 통한 서비스 이용에 관해 연대책임을 부담합니다.\r\n\r\n단체회원 계정 사용에서의 관리자, 멤버 등의 권한 및 (공동)책임에 관한 사항 등은 계정 운영정책 및 고객센터 내 네이버 단체회원(단체 아이디) 소개 등에서 확인해 주시기 바랍니다.\r\n\r\n여러분이 제공한 콘텐츠를 소중히 다룰 것입니다.\r\n네이버는 여러분이 게재한 게시물이 네이버 서비스를 통해 다른 이용자들에게 전달되어 우리 모두의 삶을 더욱 풍요롭게 해줄 것을 기대합니다. 게시물은 여러분이 타인 또는 자신이 보게 할 목적으로 네이버 서비스 상에 게재한 부호, 문자, 음성, 음향, 그림, 사진, 동영상, 링크 등으로 구성된 각종 콘텐츠 자체 또는 파일을 말합니다.\r\n\r\n네이버는 여러분의 생각과 감정이 표현된 콘텐츠를 소중히 보호할 것을 약속 드립니다. 여러분이 제작하여 게재한 게시물에 대한 지식재산권 등의 권리는 당연히 여러분에게 있습니다.\r\n\r\n한편, 네이버 서비스를 통해 여러분이 게재한 게시물을 적법하게 제공하려면 해당 콘텐츠에 대한 저장, 복제, 수정, 공중 송신, 전시, 배포, 2차적 저작물 작성(단, 번역에 한함) 등의 이용 권한(기한과 지역 제한에 정함이 없으며, 별도 대가 지급이 없는 라이선스)이 필요합니다.\r\n게시물 게재로 여러분은 네이버에게 그러한 권한을 부여하게 되므로, 여러분은 이에 필요한 권리를 보유하고 있어야 합니다.\r\n\r\n네이버는 여러분이 부여해 주신 콘텐츠 이용 권한을 저작권법 등 관련 법령에서 정하는 바에 따라 네이버 서비스 내 노출, 서비스 홍보를 위한 활용, 서비스 운영, 개선 및 새로운 서비스 개발을 위한 연구, 웹 접근성 등 법률상 의무 준수, 외부 사이트에서의 검색, 수집 및 링크 허용을 위해서만 제한적으로 행사할 것입니다.\r\n만약, 그 밖의 목적을 위해 부득이 여러분의 콘텐츠를 이용하고자 할 경우엔 사전에 여러분께 설명을 드리고 동의를 받도록 하겠습니다.\r\n\r\n또한 여러분이 제공한 소중한 콘텐츠는 네이버 서비스를 개선하고 새로운 네이버 서비스를 제공하기 위해 인공지능 분야 기술 등의 연구 개발 목적으로 네이버 및 네이버 계열사에서 사용될 수 있습니다. 네이버는 지속적인 연구 개발을 통해 여러분께 좀 더 편리하고 유용한 서비스를 제공해 드릴 수 있도록 최선을 다하겠습니다.\r\n\r\n네이버는 여러분이 자신이 제공한 콘텐츠에 대한 네이버 또는 다른 이용자들의 이용 또는 접근을 보다 쉽게 관리할 수 있도록 다양한 수단을 제공하기 위해 노력하고 있습니다. 여러분은 네이버 서비스 내에 콘텐츠 삭제, 비공개 등의 관리기능이 제공되는 경우 이를 통해 직접 타인의 이용 또는 접근을 통제할 수 있고, 고객센터를 통해서도 콘텐츠의 삭제, 비공개, 검색결과 제외 등의 조치를 요청할 수 있습니다.\r\n다만, 일부 네이버 서비스의 경우 삭제, 비공개 등의 처리가 어려울 수 있으며, 이러한 내용은 각 서비스 상의 안내, 공지사항, 고객센터 도움말 등에서 확인해 주시길 부탁 드립니다.\r\n\r\n여러분의 개인정보를 소중히 보호합니다.\r\n네이버는 서비스의 원활한 제공을 위하여 회원이 동의한 목적과 범위 내에서만 개인정보를 수집∙이용하며, 개인정보 보호 관련 법령에 따라 안전하게 관리합니다. 네이버가 이용자 및 회원에 대해 관련 개인정보를 안전하게 처리하기 위하여 기울이는 노력이나 기타 상세한 사항은 개인정보 처리방침에서 확인하실 수 있습니다.\r\n\r\n네이버는 여러분이 서비스를 이용하기 위해 일정 기간 동안 로그인 혹은 접속한 기록이 없는 경우, 전자메일, 서비스 내 알림 또는 기타 적절한 전자적 수단을 통해 사전에 안내해 드린 후 여러분의 정보를 파기하거나 분리 보관할 수 있으며, 만약 이로 인해 서비스 제공을 위해 필수적인 정보가 부족해질 경우 부득이 관련 서비스 이용계약을 해지할 수 있습니다.\r\n\r\n타인의 권리를 존중해 주세요.\r\n여러분이 무심코 게재한 게시물로 인해 타인의 저작권이 침해되거나 명예훼손 등 권리 침해가 발생할 수 있습니다. 네이버는 이에 대한 문제 해결을 위해 ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률’ 및 ‘저작권법’ 등을 근거로 권리침해 주장자의 요청에 따른 게시물 게시중단, 원 게시자의 이의신청에 따른 해당 게시물 게시 재개 등을 내용으로 하는 게시중단요청서비스를 운영하고 있습니다. 보다 상세한 내용 및 절차는 고객센터 내 게시중단요청서비스 소개를 참고해 주세요.\r\n\r\n한편, 네이버 서비스를 통해 타인의 콘텐츠를 이용한다고 하여 여러분이 해당 콘텐츠에 대한 지식재산권을 보유하게 되는 것은 아닙니다. 여러분이 해당 콘텐츠를 자유롭게 이용하기 위해서는 그 이용이 저작권법 등 관련 법률에 따라 허용되는 범위 내에 있거나, 해당 콘텐츠의 지식재산권자로부터 별도의 이용 허락을 받아야 하므로 각별한 주의가 필요합니다.\r\n\r\n네이버는 여러분이 네이버 서비스를 마음껏 이용할 수 있도록 여러분께 네이버 서비스에 수반되는 관련 소프트웨어 사용에 관한 이용 권한을 부여합니다. 이 경우 여러분의 자유로운 이용은 네이버가 제시하는 이용 조건에 부합하는 범위 내에서만 허용되고, 이러한 권한은 양도가 불가능하며, 비독점적 조건 및 법적고지가 적용된다는 점을 유의해 주세요.\r\n\r\n네이버에서 제공하는 다양한 포인트를 요긴하게 활용해 보세요.\r\n네이버는 여러분이 네이버 서비스를 효율적으로 이용할 수 있도록 포인트를 부여하고 있습니다. 포인트는 여러분의 일정한 네이버 서비스 이용과 연동하여 네이버가 임의로 책정하거나 조정하여 지급하는 일정한 계산 단위를 갖는 서비스 상의 가상 데이터를 말합니다. 포인트는 재산적 가치가 없기 때문에 금전으로 환불 또는 전환할 수 없지만, 포인트의 많고 적음에 따라 여러분의 네이버 서비스 이용에 영향을 주는 경우가 있으므로 경우에 따라 적절히 활용해 보세요.\r\n\r\n네이버는 네이버 서비스의 효율적 이용을 지원하거나 서비스 운영을 개선하기 위해 필요한 경우 사전에 여러분께 안내 드린 후 부득이 포인트의 일부 또는 전부를 조정할 수 있습니다. 그리고 포인트는 네이버가 정한 기간에 따라 주기적으로 소멸할 수도 있으니 포인트가 부여되는 네이버 서비스 이용 시 유의해 주시기 바랍니다.\r\n\r\n네이버 서비스 이용과 관련하여 몇 가지 주의사항이 있습니다.\r\n네이버는 여러분이 네이버 서비스를 자유롭고 편리하게 이용할 수 있도록 최선을 다하고 있습니다. 다만, 여러분이 네이버 서비스를 보다 안전하게 이용하고 네이버 서비스에서 여러분과 타인의 권리가 서로 존중되고 보호받으려면 여러분의 도움과 협조가 필요합니다. 여러분의 안전한 서비스 이용과 권리 보호를 위해 부득이 아래와 같은 경우 여러분의 게시물 게재나 네이버 서비스 이용이 제한될 수 있으므로, 이에 대한 확인 및 준수를 요청 드립니다.\r\n\r\n회원 가입 시 이름, 생년월일, 휴대전화번호 등의 정보를 허위로 기재해서는 안 됩니다. 회원 계정에 등록된 정보는 항상 정확한 최신 정보가 유지될 수 있도록 관리해 주세요. 자신의 계정을 다른 사람에게 판매, 양도, 대여 또는 담보로 제공하거나 다른 사람에게 그 사용을 허락해서는 안 됩니다. 아울러 자신의 계정이 아닌 타인의 계정을 무단으로 사용해서는 안 됩니다. 이에 관한 상세한 내용은 계정 운영정책을 참고해 주시기 바랍니다.\r\n타인에 대해 직접적이고 명백한 신체적 위협을 가하는 내용의 게시물, 타인의 자해 행위 또는 자살을 부추기거나 권장하는 내용의 게시물, 타인의 신상정보, 사생활 등 비공개 개인정보를 드러내는 내용의 게시물, 타인을 지속적으로 따돌리거나 괴롭히는 내용의 게시물, 성매매를 제안, 알선, 유인 또는 강요하는 내용의 게시물, 공공 안전에 대해 직접적이고 심각한 위협을 가하는 내용의 게시물은 제한될 수 있습니다.\r\n관련 법령상 금지되거나 형사처벌의 대상이 되는 행위를 수행하거나 이를 교사 또는 방조하는 등의 범죄 관련 직접적인 위험이 확인된 게시물, 관련 법령에서 홍보, 광고, 판매 등을 금지하고 있는 물건 또는 서비스를 홍보, 광고, 판매하는 내용의 게시물, 타인의 지식재산권 등을 침해하거나 모욕, 사생활 침해 또는 명예훼손 등 타인의 권리를 침해하는 내용이 확인된 게시물은 제한될 수 있습니다.\r\n자극적이고 노골적인 성행위를 묘사하는 등 타인에게 성적 수치심을 유발시키거나 왜곡된 성 의식 등을 야기할 수 있는 내용의 게시물, 타인에게 잔혹감 또는 혐오감을 일으킬 수 있는 폭력적이고 자극적인 내용의 게시물, 본인 이외의 자를 사칭하거나 허위사실을 주장하는 등 타인을 기만하는 내용의 게시물, 과도한 욕설, 비속어 등을 계속하여 반복적으로 사용하여 심한 혐오감 또는 불쾌감을 일으키는 내용의 게시물은 제한될 수 있습니다.\r\n자동화된 수단을 활용하는 등 네이버 서비스의 기능을 비정상적으로 이용하여 게재된 게시물, 네이버 각 개별 서비스의 제공 취지와 부합하지 않는 내용의 게시물은 다른 이용자들의 정상적인 네이버 서비스 이용에 불편을 초래하고 더 나아가 네이버의 원활한 서비스 제공을 방해하므로 역시 제한될 수 있습니다. 기타 제한되는 게시물에 관한 상세한 내용은 게시물 운영정책 및 각 개별 서비스에서의 약관, 운영정책 등을 참고해 주시기 바랍니다.\r\n네이버의 사전 허락 없이 자동화된 수단(예: 매크로 프로그램, 로봇(봇), 스파이더, 스크래퍼 등)을 이용하여 네이버 서비스 회원으로 가입을 시도 또는 가입하거나, 네이버 서비스에 로그인을 시도 또는 로그인하거나, 네이버 서비스 상에 게시물을 게재하거나, 네이버 서비스를 통해 커뮤니케이션하거나(예: 전자메일, 쪽지 등), 네이버 서비스에 게재된 회원의 아이디(ID), 게시물 등을 수집하거나, 네이버 검색 서비스에서 특정 질의어로 검색하거나 혹은 그 검색결과에서 특정 검색결과를 선택(이른바 ‘클릭’)하는 등 이용자(사람)의 실제 이용을 전제로 하는 네이버 서비스의 제공 취지에 부합하지 않는 방식으로 네이버 서비스를 이용하거나 이와 같은 네이버 서비스에 대한 어뷰징(남용) 행위를 막기 위한 네이버의 기술적 조치를 무력화하려는 일체의 행위(예: IP를 지속적으로 바꿔가며 접속하는 행위, Captcha를 외부 솔루션 등을 통해 우회하거나 무력화 하는 행위 등)를 시도해서는 안 됩니다.\r\n네이버의 동의 없이 자동화된 수단에 의해 네이버 서비스 상에 광고가 게재되는 영역 또는 그 밖의 영역에 부호, 문자, 음성, 음향, 그림, 사진, 동영상, 링크 등으로 구성된 각종 콘텐츠 자체 또는 파일을 삽입해서는 안 됩니다. 또한, 네이버 서비스 또는 이에 포함된 소프트웨어를 복사, 수정할 수 없으며, 이를 판매, 양도, 대여 또는 담보로 제공하거나 타인에게 그 이용을 허락해서는 안 됩니다. 네이버 서비스에 포함된 소프트웨어를 역 설계, 소스코드 추출 시도, 복제, 분해, 모방, 기타 변형하는 등의 행위도 금지됩니다(다만, 오픈소스에 해당되는 경우 그 자체 조건에 따릅니다). 그 밖에 바이러스나 기타 악성 코드를 업로드하거나 네이버 서비스의 원활한 운영을 방해할 목적으로 서비스 기능을 비정상적으로 이용하는 행위 역시 금지됩니다.\r\n네이버는 본 약관의 범위 내에서 게시물 운영정책, 각 개별 서비스에서의 약관 또는 운영정책, 각 서비스 상의 안내, 공지사항, 고객센터 도움말 등을 두어, 여러분에게 안정적이고 원활한 서비스 이용이 가능하도록 지원하고 있습니다. 각 세부 정책에는 여러분이 참고할 수 있도록 보다 구체적인 유의사항을 포함하고 있으니, 본 약관 본문 및 구성 페이지 상의 링크 등을 통해 이를 확인해 주시기 바랍니다.\r\n\r\n부득이 서비스 이용을 제한할 경우 합리적인 절차를 준수합니다.\r\n네이버는 다양한 정보와 의견이 담긴 여러분의 콘텐츠를 소중히 다룰 것을 약속 드립니다만, 여러분이 게재한 게시물이 관련 법령, 본 약관, 게시물 운영정책, 각 개별 서비스에서의 약관, 운영정책 등에 위배되는 경우, 부득이 이를 비공개 또는 삭제 처리하거나 게재를 거부할 수 있습니다. 다만, 이것이 네이버가 모든 콘텐츠를 검토할 의무가 있다는 것을 의미하지는 않습니다.\r\n\r\n또한 여러분이 관련 법령, 본 약관, 계정 및 게시물 운영정책, 각 개별 서비스에서의 약관, 운영정책 등을 준수하지 않을 경우, 네이버는 여러분의 관련 행위 내용을 확인할 수 있으며, 그 확인 결과에 따라 네이버 서비스 이용에 대한 주의를 당부하거나, 네이버 서비스 이용을 일부 또는 전부, 일시 또는 영구히 정지시키는 등 그 이용을 제한할 수 있습니다. 한편, 이러한 이용 제한에도 불구하고 더 이상 네이버 서비스 이용계약의 온전한 유지를 기대하기 어려운 경우엔 부득이 여러분과의 이용계약을 해지할 수 있습니다.\r\n\r\n부득이 여러분의 서비스 이용을 제한해야 할 경우 명백한 법령 위반이나 타인의 권리침해로서 긴급한 위험 또는 피해 차단이 요구되는 사안 외에는 위와 같은 단계적 서비스 이용제한 원칙을 준수 하겠습니다. 명백한 법령 위반 등을 이유로 부득이 서비스 이용을 즉시 영구 정지시키는 경우 서비스 이용을 통해 획득한 포인트 및 기타 혜택 등은 모두 소멸되고 이에 대해 별도로 보상하지 않으므로 유의해 주시기 바랍니다. 서비스 이용 제한의 조건, 세부 내용 등은 계정 운영정책 및 각 개별 서비스에서의 운영정책을 참고하시기 바랍니다.\r\n\r\n네이버의 잘못은 네이버가 책임집니다.\r\n네이버는 여러분이 네이버 서비스를 이용함에 있어 네이버의 고의 또는 과실로 인하여 손해를 입게 될 경우 관련 법령에 따라 여러분의 손해를 배상합니다. 다만, 천재지변 또는 이에 준하는 불가항력으로 인하여 네이버가 서비스를 제공할 수 없거나 이용자의 고의 또는 과실로 인하여 서비스를 이용할 수 없어 발생한 손해에 대해서 네이버는 책임을 부담하지 않습니다.\r\n\r\n그리고 네이버가 손해배상책임을 부담하는 경우에도 통상적으로 예견이 불가능하거나 특별한 사정으로 인한 특별 손해 또는 간접 손해, 기타 징벌적 손해에 대해서는 관련 법령에 특별한 규정이 없는 한 책임을 부담하지 않습니다.\r\n\r\n한편, 네이버 서비스를 매개로 한 여러분과 다른 회원 간 또는 여러분과 비회원 간의 의견 교환, 거래 등에서 발생한 손해나 여러분이 서비스 상에 게재된 타인의 게시물 등의 콘텐츠를 신뢰함으로써 발생한 손해에 대해서도 네이버는 특별한 사정이 없는 한 이에 대해 책임을 부담하지 않습니다.\r\n\r\n언제든지 네이버 서비스 이용계약을 해지하실 수 있습니다.\r\n네이버에게는 참 안타까운 일입니다만, 회원은 언제든지 네이버 서비스 이용계약 해지를 신청하여 회원에서 탈퇴할 수 있으며, 이 경우 네이버는 관련 법령 등이 정하는 바에 따라 이를 지체 없이 처리하겠습니다.\r\n\r\n네이버 서비스 이용계약이 해지되면, 관련 법령 및 개인정보처리방침에 따라 네이버가 해당 회원의 정보를 보유할 수 있는 경우를 제외하고, 해당 회원 계정에 부속된 게시물 일체를 포함한 회원의 모든 데이터는 소멸됨과 동시에 복구할 수 없게 됩니다. 다만, 이 경우에도 다른 회원이 별도로 담아갔거나 스크랩한 게시물과 공용 게시판에 등록한 댓글 등의 게시물은 삭제되지 않으므로 반드시 해지 신청 이전에 삭제하신 후 탈퇴하시기 바랍니다.\r\n\r\n일부 네이버 서비스에는 광고가 포함되어 있습니다.\r\n여러분이 다양한 네이버 서비스를 이용하다 보면 간혹 일부 개별 서비스에 광고가 포함된 경우가 있습니다. 네이버 서비스를 이용하면서 발생할 수 있는 데이터 통신요금은 가입하신 통신사업자와의 이용계약에 따라 여러분이 부담하며, 포함된 광고 열람으로 인해 추가적으로 발생하는 비용 역시 여러분이 부담합니다.\r\n\r\n원하는 네이버 서비스를 이용하기 위해 원하지 않는 광고를 봐야 하는 경우가 있습니다. 이는 여러분에게 제공하는 다양한 네이버 서비스를 원칙적으로 무료로 제공할 수 있게 해주는 데 기여하며, 더 나아가 네이버가 연구 개발에 투자하여 더 나은 서비스를 제공할 수 있는 기반이 됩니다. 최근 타사의 일부 서비스들이 광고 없는 서비스 이용을 강조하며 주된 서비스를 유료로 제공하고 있는 관행이 이를 뒷받침합니다.\r\n\r\n네이버는 여러분의 본의 아닌 불편이나 부담이 최소화될 수 있는 방법에 대해 항상 고민하고 개선해 나가겠습니다.\r\n\r\n서비스 중단 또는 변경 시 꼭 알려드리겠습니다.\r\n네이버는 연중 무휴, 1일 24시간 안정적으로 서비스를 제공하기 위해 최선을 다하고 있습니다만, 컴퓨터, 서버 등 정보통신설비의 보수점검, 교체 또는 고장, 통신두절 등 운영상 상당한 이유가 있는 경우 부득이 서비스의 전부 또는 일부를 중단할 수 있습니다.\r\n\r\n한편, 네이버는 서비스 운영 또는 개선을 위해 상당한 필요성이 있는 경우 서비스의 전부 또는 일부를 수정, 변경 또는 종료할 수 있습니다. 무료로 제공되는 서비스의 전부 또는 일부를 수정, 변경 또는 종료하게 된 경우 관련 법령에 특별한 규정이 없는 한 별도의 보상을 하지 않습니다.\r\n\r\n이 경우 네이버는 예측 가능한 경우 상당기간 전에 이를 안내하며, 만약 예측 불가능한 경우라면 사후 지체 없이 상세히 설명하고 안내 드리겠습니다. 또한 서비스 중단의 경우에는 여러분 자신의 콘텐츠를 백업할 수 있도록 합리적이고 충분한 기회를 제공하도록 하겠습니다.\r\n\r\n주요 사항을 잘 안내하고 여러분의 소중한 의견에 귀 기울이겠습니다.\r\n네이버는 서비스 이용에 필요한 주요사항을 적시에 잘 안내해 드릴 수 있도록 힘쓰겠습니다. 회원에게 통지를 하는 경우 전자메일, 서비스 내 알림 또는 기타 적절한 전자적 수단을 통해 개별적으로 알려 드릴 것이며, 다만 회원 전체에 대한 통지가 필요할 경우엔 7일 이상 www.naver.com을 비롯한 네이버 도메인의 웹사이트 및 응용프로그램(어플리케이션, 앱) 초기 화면 또는 공지사항 등에 관련 내용을 게시하도록 하겠습니다.\r\n\r\n네이버는 여러분의 소중한 의견에 귀 기울이겠습니다. 여러분은 언제든지 고객센터를 통해 서비스 이용과 관련된 의견이나 개선사항을 전달할 수 있으며, 네이버는 합리적 범위 내에서 가능한 그 처리과정 및 결과를 여러분께 전달할 수 있도록 하겠습니다.\r\n\r\n여러분이 쉽게 알 수 있도록 약관 및 운영정책을 게시하며 사전 공지 후 개정합니다.\r\n네이버는 본 약관의 내용을 여러분이 쉽게 확인할 수 있도록 서비스 초기 화면에 게시하고 있습니다.\r\n\r\n네이버는 수시로 본 약관, 계정 및 게시물 운영정책을 개정할 수 있습니다만, 관련 법령을 위배하지 않는 범위 내에서 개정할 것이며, 사전에 그 개정 이유와 적용 일자를 서비스 내에 알리도록 하겠습니다. 또한 여러분에게 불리할 수 있는 중대한 내용의 약관 변경의 경우에는 최소 30일 이전에 해당 서비스 내 공지하고 별도의 전자적 수단(전자메일, 서비스 내 알림 등)을 통해 개별적으로 알릴 것입니다.\r\n\r\n네이버는 변경된 약관을 게시한 날로부터 효력이 발생되는 날까지 약관 변경에 대한 여러분의 의견을 기다립니다. 위 기간이 지나도록 여러분의 의견이 네이버에 접수되지 않으면, 여러분이 변경된 약관에 따라 서비스를 이용하는 데에 동의하는 것으로 간주됩니다. 네이버로서는 매우 안타까운 일이지만, 여러분이 변경된 약관에 동의하지 않는 경우 변경된 약관의 적용을 받는 해당 서비스의 제공이 더 이상 불가능하게 될 수 있습니다.\r\n\r\n네이버 서비스에는 기본적으로 본 약관이 적용됩니다만, 부득이 각 개별 서비스의 고유한 특성을 반영하기 위해 본 약관 외 별도의 약관, 운영정책이 추가로 적용될 때가 있습니다. 따라서 별도의 약관, 운영정책에서 그 개별 서비스 제공에 관하여 본 약관, 계정 및 게시물 운영정책과 다르게 정한 경우에는 별도의 약관, 운영정책이 우선하여 적용됩니다. 이러한 내용은 각각의 개별 서비스 초기 화면에서 확인해 주시기 바랍니다.\r\n\r\n본 약관은 한국어를 정본으로 합니다. 본 약관 또는 네이버 서비스와 관련된 여러분과 네이버와의 관계에는 대한민국의 법령이 적용됩니다. 그리고 본 약관 또는 네이버 서비스와 관련하여 여러분과 네이버 사이에 분쟁이 발생할 경우, 그 분쟁의 처리는 대한민국 \'민사소송법\'에서 정한 절차를 따릅니다.\r\n\r\n공지 일자: 2018년 3월 30일\r\n적용 일자: 2018년 5월 1일\r\n네이버 서비스와 관련하여 궁금하신 사항이 있으시면 고객센터(대표번호: 1588 – 3820/ 평일 09:00~18:00)로 문의 주시기 바랍니다.', '개인정보보호법에 따라 네이버에 회원가입 신청하시는 분께 수집하는 개인정보의 항목, 개인정보의 수집 및 이용목적, 개인정보의 보유 및 이용기간, 동의 거부권 및 동의 거부 시 불이익에 관한 사항을 안내 드리오니 자세히 읽은 후 동의하여 주시기 바랍니다.\r\n\r\n1. 수집하는 개인정보\r\n이용자는 회원가입을 하지 않아도 정보 검색, 뉴스 보기 등 대부분의 네이버 서비스를 회원과 동일하게 이용할 수 있습니다. 이용자가 메일, 캘린더, 카페, 블로그 등과 같이 개인화 혹은 회원제 서비스를 이용하기 위해 회원가입을 할 경우, 네이버는 서비스 이용을 위해 필요한 최소한의 개인정보를 수집합니다.\r\n\r\n회원가입 시점에 네이버가 이용자로부터 수집하는 개인정보는 아래와 같습니다.\r\n- 회원 가입 시 필수항목으로 아이디, 비밀번호, 이름, 생년월일, 성별, 휴대전화번호를, 선택항목으로 이메일주소를 수집합니다. 실명 인증된 아이디로 가입 시, 암호화된 동일인 식별정보(CI), 중복가입 확인정보(DI), 내외국인 정보를 함께 수집합니다. 만 14세 미만 아동의 경우, 법정대리인 정보(법정대리인의 이름, 생년월일, 성별, 중복가입확인정보(DI), 휴대전화번호)를 추가로 수집합니다.\r\n- 비밀번호 없이 회원 가입 시에는 필수항목으로 아이디, 이름, 생년월일, 휴대전화번호를, 선택항목으로 비밀번호를 수집합니다.\r\n- 단체 회원가입 시 필수 항목으로 단체아이디, 비밀번호, 단체이름, 이메일주소, 휴대전화번호를, 선택항목으로 단체 대표자명을 수집합니다.\r\n서비스 이용 과정에서 이용자로부터 수집하는 개인정보는 아래와 같습니다.\r\n- 회원정보 또는 개별 서비스에서 프로필 정보(별명, 프로필 사진)를 설정할 수 있습니다. 회원정보에 별명을 입력하지 않은 경우에는 마스킹 처리된 아이디가 별명으로 자동 입력됩니다.\r\n- 네이버 내의 개별 서비스 이용, 이벤트 응모 및 경품 신청 과정에서 해당 서비스의 이용자에 한해 추가 개인정보 수집이 발생할 수 있습니다. 추가로 개인정보를 수집할 경우에는 해당 개인정보 수집 시점에서 이용자에게 ‘수집하는 개인정보 항목, 개인정보의 수집 및 이용목적, 개인정보의 보관기간’에 대해 안내 드리고 동의를 받습니다.\r\n\r\n\r\n\r\n서비스 이용 과정에서 IP 주소, 쿠키, 서비스 이용 기록, 기기정보, 위치정보가 생성되어 수집될 수 있습니다. 또한 이미지 및 음성을 이용한 검색 서비스 등에서 이미지나 음성이 수집될 수 있습니다.\r\n구체적으로 1) 서비스 이용 과정에서 이용자에 관한 정보를 자동화된 방법으로 생성하여 이를 저장(수집)하거나, 2) 이용자 기기의 고유한 정보를 원래의 값을 확인하지 못 하도록 안전하게 변환하여 수집합니다.\r\n서비스 이용 과정에서 위치정보가 수집될 수 있으며,\r\n네이버에서 제공하는 위치기반 서비스에 대해서는 \'네이버 위치기반서비스 이용약관\'에서 자세하게 규정하고 있습니다.\r\n이와 같이 수집된 정보는 개인정보와의 연계 여부 등에 따라 개인정보에 해당할 수 있고, 개인정보에 해당하지 않을 수도 있습니다.\r\n생성정보 수집에 대한 추가 설명\r\n- IP(Internet Protocol) 주소란?\r\nIP 주소는 인터넷 망 사업자가 인터넷에 접속하는 이용자의 PC 등 기기에 부여하는 온라인 주소정보 입니다. IP 주소가 개인정보에 해당하는지 여부에 대해서는 각국마다 매우 다양한 견해가 있습니다.\r\n- 서비스 이용기록이란?\r\n네이버 접속 일시, 이용한 서비스 목록 및 서비스 이용 과정에서 발생하는 정상 또는 비정상 로그 일체,메일 수발신 과정에서 기록되는 이메일주소, 친구 초대하기 또는 선물하기 등에서 입력하는 휴대전화번호, 스마트스토어 판매자와 구매자간 상담내역(네이버톡톡 및 상품 Q&A 게시글) 등을 의미합니다.\r\n- 기기정보란?\r\n본 개인정보처리방침에 기재된 기기정보는 생산 및 판매 과정에서 기기에 부여된 정보뿐 아니라, 기기의 구동을 위해 사용되는 S/W를 통해 확인 가능한 정보를 모두 일컫습니다. OS(Windows, MAC OS 등) 설치 과정에서 이용자가 PC에 부여하는 컴퓨터의 이름, PC에 장착된 주변기기의 일련번호, 스마트폰의 통신에 필요한 고유한 식별값(IMEI, IMSI), AAID 혹은 IDFA, 설정언어 및 설정 표준시, USIM의 통신사 코드 등을 의미합니다. 단, 네이버는 IMEI와 같은 기기의 고유한 식별값을 수집할 필요가 있는 경우, 이를 수집하기 전에 네이버도 원래의 값을 알아볼 수 없는 방식으로 암호화 하여 식별성(Identifiability)을 제거한 후에 수집합니다.\r\n- 쿠키(cookie)란?\r\n쿠키는 이용자가 웹사이트를 접속할 때에 해당 웹사이트에서 이용자의 웹브라우저를 통해 이용자의 PC에 저장하는 매우 작은 크기의 텍스트 파일입니다. 이후 이용자가 다시 웹사이트를 방문할 경우 웹사이트 서버는 이용자 PC에 저장된 쿠키의 내용을 읽어 이용자가 설정한 서비스 이용 환경을 유지하여 편리한 인터넷 서비스 이용을 가능케 합니다. 또한 방문한 서비스 정보, 서비스 접속 시간 및 빈도, 서비스 이용 과정에서 생성된 또는 제공(입력)한 정보 등을 분석하여 이용자의 취향과 관심에 특화된 서비스(광고 포함)를 제공할 수 있습니다. 이용자는 쿠키에 대한 선택권을 가지고 있으며, 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다. 다만, 쿠키의 저장을 거부할 경우에는 로그인이 필요한 네이버 일부 서비스의 이용에 불편이 있을 수 있습니다.\r\n쿠키에 관한 자세한 내용(네이버 프라이버시 센터) 알아보기\r\n\r\n2. 수집한 개인정보의 이용\r\n네이버 및 네이버 관련 제반 서비스(모바일 웹/앱 포함)의 회원관리, 서비스 개발・제공 및 향상, 안전한 인터넷 이용환경 구축 등 아래의 목적으로만 개인정보를 이용합니다.\r\n\r\n- 회원 가입 의사의 확인, 연령 확인 및 법정대리인 동의 진행, 이용자 및 법정대리인의 본인 확인, 이용자 식별, 회원탈퇴 의사의 확인 등 회원관리를 위하여 개인정보를 이용합니다.\r\n- 콘텐츠 등 기존 서비스 제공(광고 포함)에 더하여, 인구통계학적 분석, 서비스 방문 및 이용기록의 분석, 개인정보 및 관심에 기반한 이용자간 관계의 형성, 지인 및 관심사 등에 기반한 맞춤형 서비스 제공 등 신규 서비스 요소의 발굴 및 기존 서비스 개선 등을 위하여 개인정보를 이용합니다.\r\n- 법령 및 네이버 이용약관을 위반하는 회원에 대한 이용 제한 조치, 부정 이용 행위를 포함하여 서비스의 원활한 운영에 지장을 주는 행위에 대한 방지 및 제재, 계정도용 및 부정거래 방지, 약관 개정 등의 고지사항 전달, 분쟁조정을 위한 기록 보존, 민원처리 등 이용자 보호 및 서비스 운영을 위하여 개인정보를 이용합니다.\r\n- 유료 서비스 제공에 따르는 본인인증, 구매 및 요금 결제, 상품 및 서비스의 배송을 위하여 개인정보를 이용합니다.\r\n- 이벤트 정보 및 참여기회 제공, 광고성 정보 제공 등 마케팅 및 프로모션 목적으로 개인정보를 이용합니다.\r\n- 서비스 이용기록과 접속 빈도 분석, 서비스 이용에 대한 통계, 서비스 분석 및 통계에 따른 맞춤 서비스 제공 및 광고 게재 등에 개인정보를 이용합니다.\r\n- 보안, 프라이버시, 안전 측면에서 이용자가 안심하고 이용할 수 있는 서비스 이용환경 구축을 위해 개인정보를 이용합니다.\r\n3. 개인정보의 보관기간\r\n회사는 원칙적으로 이용자의 개인정보를 회원 탈퇴 시 지체없이 파기하고 있습니다.\r\n단, 이용자에게 개인정보 보관기간에 대해 별도의 동의를 얻은 경우, 또는 법령에서 일정 기간 정보보관 의무를 부과하는 경우에는 해당 기간 동안 개인정보를 안전하게 보관합니다.\r\n이용자에게 개인정보 보관기간에 대해 회원가입 시 또는 서비스 가입 시 동의를 얻은 경우는 아래와 같습니다.\r\n- 부정 가입 및 이용 방지\r\n부정 이용자의 가입인증 휴대전화번호 또는 DI (만 14세 미만의 경우 법정대리인DI) : 탈퇴일로부터 6개월 보관\r\n탈퇴한 이용자의 휴대전화번호(휴대전화 인증 시), DI(아이핀 인증 시): 탈퇴일로부터 6개월 보관(복호화가 불가능한 일방향 암호화(해시)하여 보관)\r\n- 네이버 서비스 제공을 위한 본인 확인\r\n통신사 정보 : 수집 시점으로부터 1년 보관\r\n- QR코드 복구 요청 대응\r\nQR코드 등록 정보:삭제 시점으로부터6개월 보관\r\n- 스마트플레이스 분쟁 조정 및 고객문의 대응\r\n휴대전화번호:등록/수정/삭제 요청 시로부터 최대1년\r\n- 네이버 플러스 멤버십 서비스 혜택 중복 제공 방지\r\n암호화처리(해시처리)한DI : 네이버 회원 탈퇴일로부터 6개월 보관\r\n- 네이버 엑스퍼트 재가입 신청 및 부정 이용 방지\r\n네이버 엑스퍼트 서비스 및 네이버 엑스퍼트 센터 가입 등록정보&판매자 이름 : 신청일로부터 6개월(등록 거절 시, 거절 의사 표시한 날로부터 30일) 보관\r\n- 전자서명 인증 업무\r\n개인정보: 네이버 인증서 서비스 해지 시까지 보관\r\n- 인증서와 인증 업무에 관한 기록: 인증서 효력 상실일로부터 5년 보관\r\n전자상거래 등에서의 소비자 보호에 관한 법률, 전자문서 및 전자거래 기본법, 통신비밀보호법 등 법령에서 일정기간 정보의 보관을 규정하는 경우는 아래와 같습니다. 네이버는 이 기간 동안 법령의 규정에 따라 개인정보를 보관하며, 본 정보를 다른 목적으로는 절대 이용하지 않습니다.\r\n- 전자상거래 등에서 소비자 보호에 관한 법률\r\n계약 또는 청약철회 등에 관한 기록: 5년 보관\r\n대금결제 및 재화 등의 공급에 관한 기록: 5년 보관\r\n소비자의 불만 또는 분쟁처리에 관한 기록: 3년 보관\r\n- 전자문서 및 전자거래 기본법\r\n공인전자주소를 통한 전자문서 유통에 관한 기록 : 10년 보관\r\n- 통신비밀보호법\r\n로그인 기록: 3개월\r\n\r\n4. 개인정보 수집 및 이용 동의를 거부할 권리\r\n이용자는 개인정보의 수집 및 이용 동의를 거부할 권리가 있습니다. 회원가입 시 수집하는 최소한의 개인정보, 즉, 필수 항목에 대한 수집 및 이용 동의를 거부하실 경우, 회원가입이 어려울 수 있습니다.', '네이버 서비스 및 제휴 이벤트・혜택 등의 정보를 휴대전화(네이버앱 알림 또는 문자), 이메일로 받을 수 있습니다. 일부 서비스(별개의 회원 체계 운영, 네이버 가입 후 추가 가입하는 서비스 등)의 경우, 수신에 대해 별도로 안내드리며 동의를 구합니다.');

-- 테이블 jboard.user 구조 내보내기
DROP TABLE IF EXISTS `user`;
CREATE TABLE IF NOT EXISTS `user` (
  `uid` varchar(20) NOT NULL,
  `pass` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `name` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `nick` varchar(20) NOT NULL,
  `email` varchar(30) NOT NULL,
  `hp` varchar(255) DEFAULT NULL,
  `role` varchar(20) DEFAULT 'USER',
  `zip` varchar(255) DEFAULT NULL,
  `addr1` varchar(100) DEFAULT NULL,
  `addr2` varchar(100) DEFAULT NULL,
  `regip` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `sms` varchar(255) DEFAULT NULL,
  `regDate` datetime DEFAULT NULL,
  `leaveDate` datetime DEFAULT NULL,
  `provider` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `nick` (`nick`),
  UNIQUE KEY `email` (`email`),
  UNIQUE KEY `hp` (`hp`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 jboard.user:~7 rows (대략적) 내보내기
DELETE FROM `user`;
INSERT INTO `user` (`uid`, `pass`, `name`, `nick`, `email`, `hp`, `role`, `zip`, `addr1`, `addr2`, `regip`, `sms`, `regDate`, `leaveDate`, `provider`) VALUES
	('a10', '$2a$10$kSxmYr7idp5w7f4.pQpN1u2QJ66o.9ZOMFc62UaDBcEixqsD7nsyC', 'asdfh', 'dfjahdlfjh', 'or2@nad.vom', '010-1234-5674', 'USER', '', NULL, NULL, '0:0:0:0:0:0:0:1', NULL, '2024-03-18 13:51:16', NULL, NULL),
	('a101', '0ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c', '감감감', '감셋', 'uk@nmli.net', '010-6666-6666', 'USER', NULL, NULL, NULL, '0:0:0:0:0:0:0:1', NULL, '2024-02-06 09:28:50', NULL, NULL),
	('a102', '0ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c', '식곰', '곰곰', 'oop_9h@namver.ckj', '010-1112-2121', 'USER', NULL, NULL, NULL, '0:0:0:0:0:0:0:1', 'y', '2024-02-13 12:22:10', NULL, NULL),
	('a103', '0ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c', '흑곰', '곰곰이', 'qpwoeo@nasdf.vpl', '010-7894-1234', 'USER', NULL, NULL, NULL, '0:0:0:0:0:0:0:1', 'n', '2024-02-13 12:24:59', NULL, NULL),
	('A107', '$2a$10$mHQXk1GIxRgGYtd8tmnqaOd7Ev0JcKLp3io0S61e0RA7FeVNFqwZC', '오아람', '오아람람', 'oor92@nav.erpomc', '010-1234-5678', 'USER', '', NULL, NULL, '0:0:0:0:0:0:0:1', NULL, '2024-03-18 14:02:15', NULL, NULL),
	('ab12', '03ac674216f3e15c761ee1a5e255f067953623c8b388b4459e13f978d7c846f4', '한송이', '노놉', 'asdf@ahsdjkf', '010-4568-1222', 'USER', NULL, NULL, NULL, '0:0:0:0:0:0:0:1', NULL, '2024-02-05 12:28:29', NULL, NULL),
	('sois92', '$2a$10$z.HTq9A9ym3OMSo90iXTCO74mXI1wcNZI8IJocQF2HGU.LjcYEmJq', '오아람', '고뮈', 'oharam0413@gmail.com', '010-9619-7319', 'USER', '48038', '부산 해운대구 선수촌로 95', '104-110', '0:0:0:0:0:0:0:1', NULL, '2024-03-19 12:44:45', NULL, NULL);


-- studydb 데이터베이스 구조 내보내기
DROP DATABASE IF EXISTS `studydb`;
CREATE DATABASE IF NOT EXISTS `studydb` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `studydb`;

-- 테이블 studydb.account 구조 내보내기
DROP TABLE IF EXISTS `account`;
CREATE TABLE IF NOT EXISTS `account` (
  `acc_id` char(14) NOT NULL,
  `cust_jumin` varchar(20) DEFAULT NULL,
  `acc_type` varchar(20) NOT NULL,
  `acc_balance` int NOT NULL,
  `acc_card` char(1) NOT NULL,
  `acc_register_date` datetime DEFAULT NULL,
  PRIMARY KEY (`acc_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.account:~10 rows (대략적) 내보내기
DELETE FROM `account`;
INSERT INTO `account` (`acc_id`, `cust_jumin`, `acc_type`, `acc_balance`, `acc_card`, `acc_register_date`) VALUES
	('1011-1001-1001', '760121-1234567', '자유입출금', 4160000, 'Y', '2020-01-21 00:00:00'),
	('1011-1001-1002', '890530-1234567', '자유입출금', 3760000, 'Y', '2020-01-21 00:00:00'),
	('1011-1001-1003', '790413-1234567', '자유입출금', 1200000, 'Y', '2020-01-21 00:00:00'),
	('1011-1001-1004', '660912-1234567', '정기적금', 1000000, 'N', '2020-01-21 00:00:00'),
	('1011-1001-1005', '840615-1234567', '자유입출금', 820000, 'Y', '2020-01-21 00:00:00'),
	('1011-1001-1006', '651021-1234567', '자유입출금', 3520000, 'Y', '2020-01-21 00:00:00'),
	('1011-1001-1007', '721128-1234567', '자유입출금', 7620500, 'Y', '2020-01-21 00:00:00'),
	('1011-1001-1008', '920907-1234567', '정기적금', 3400000, 'N', '2020-01-21 00:00:00'),
	('1011-1001-1009', '891209-1234567', '자유입출금', 1763000, 'Y', '2020-01-21 00:00:00'),
	('1011-1001-1010', '770314-1234567', '정기적금', 1080000, 'N', '2020-01-21 00:00:00');

-- 테이블 studydb.board_article 구조 내보내기
DROP TABLE IF EXISTS `board_article`;
CREATE TABLE IF NOT EXISTS `board_article` (
  `no` int NOT NULL AUTO_INCREMENT,
  `rDate` datetime(6) DEFAULT NULL,
  `content` varchar(255) DEFAULT NULL,
  `title` varchar(255) DEFAULT NULL,
  `writer` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`no`),
  KEY `FKe2j3c1fedf3c8xde6wp7j5hv2` (`writer`),
  CONSTRAINT `FKe2j3c1fedf3c8xde6wp7j5hv2` FOREIGN KEY (`writer`) REFERENCES `board_user` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.board_article:~0 rows (대략적) 내보내기
DELETE FROM `board_article`;

-- 테이블 studydb.board_comment 구조 내보내기
DROP TABLE IF EXISTS `board_comment`;
CREATE TABLE IF NOT EXISTS `board_comment` (
  `cno` int NOT NULL AUTO_INCREMENT,
  `parent` int DEFAULT NULL,
  `regDate` datetime(6) DEFAULT NULL,
  `content` varchar(255) DEFAULT NULL,
  `writer` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`cno`),
  KEY `FKahre5ek2aayqjai2xalmyq84g` (`parent`),
  KEY `FKikyrrvh4ra4io4kwecbq6cjm1` (`writer`),
  CONSTRAINT `FKahre5ek2aayqjai2xalmyq84g` FOREIGN KEY (`parent`) REFERENCES `board_article` (`no`),
  CONSTRAINT `FKikyrrvh4ra4io4kwecbq6cjm1` FOREIGN KEY (`writer`) REFERENCES `board_user` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.board_comment:~0 rows (대략적) 내보내기
DELETE FROM `board_comment`;

-- 테이블 studydb.board_file 구조 내보내기
DROP TABLE IF EXISTS `board_file`;
CREATE TABLE IF NOT EXISTS `board_file` (
  `ano` int DEFAULT NULL,
  `fno` int NOT NULL AUTO_INCREMENT,
  `oName` varchar(255) DEFAULT NULL,
  `sName` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`fno`),
  UNIQUE KEY `UK_ponyiujsk782wx8064yjxb0pp` (`ano`),
  CONSTRAINT `FKbsylu1vroewx1f5dkd6un1k82` FOREIGN KEY (`ano`) REFERENCES `board_article` (`no`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.board_file:~0 rows (대략적) 내보내기
DELETE FROM `board_file`;

-- 테이블 studydb.board_user 구조 내보내기
DROP TABLE IF EXISTS `board_user`;
CREATE TABLE IF NOT EXISTS `board_user` (
  `regDate` datetime(6) DEFAULT NULL,
  `hp` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `uid` varchar(255) NOT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.board_user:~0 rows (대략적) 내보내기
DELETE FROM `board_user`;

-- 테이블 studydb.bookorder 구조 내보내기
DROP TABLE IF EXISTS `bookorder`;
CREATE TABLE IF NOT EXISTS `bookorder` (
  `orderno` int DEFAULT NULL,
  `orderdate` date DEFAULT NULL,
  `userid` varchar(10) DEFAULT NULL,
  `username` varchar(10) DEFAULT NULL,
  `useraddr` varchar(50) DEFAULT NULL,
  `bookno` int DEFAULT NULL,
  `bookname` varchar(20) DEFAULT NULL,
  `count` int DEFAULT NULL,
  `price` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.bookorder:~7 rows (대략적) 내보내기
DELETE FROM `bookorder`;
INSERT INTO `bookorder` (`orderno`, `orderdate`, `userid`, `username`, `useraddr`, `bookno`, `bookname`, `count`, `price`) VALUES
	(10001, '2024-01-18', 'a101', '김유신', '김해', 101, '프로그래밍', 1, 28000),
	(10002, '2024-01-18', 'a102', '김춘추', '경주', 101, '프로그래밍', 1, 28000),
	(10002, '2024-01-18', 'a102', '김춘추', '경주', 102, '자료구조', 2, 160000),
	(10003, '2024-01-18', 'a103', '장보고', '완도', 102, '자료구조', 2, 32000),
	(10004, '2024-01-18', 'a104', '강감찬', '서울', 110, '데이터베이스', 2, 25000),
	(10005, '2024-01-18', 'a105', '이순신', '서울', 110, '데이터베이스', 1, 25000),
	(10005, '2024-01-18', 'a105', '이순신', '서울', 102, '자료구조', 1, 16000),
	(10007, '2024-04-04', 'a221', '오아람', '부산', 110, '프로그래밍', 3, 50000);

-- 테이블 studydb.card 구조 내보내기
DROP TABLE IF EXISTS `card`;
CREATE TABLE IF NOT EXISTS `card` (
  `card_no` char(14) NOT NULL,
  `cust_jumin` varchar(20) DEFAULT NULL,
  `acc_id` char(14) DEFAULT NULL,
  `card_register_date` date DEFAULT NULL,
  `card_limit_money` int DEFAULT NULL,
  `card_approve_date` date DEFAULT NULL,
  `card_type` varchar(10) NOT NULL,
  PRIMARY KEY (`card_no`),
  KEY `cust_jumin` (`cust_jumin`),
  KEY `card_FK` (`acc_id`),
  CONSTRAINT `card_FK` FOREIGN KEY (`acc_id`) REFERENCES `account` (`acc_id`),
  CONSTRAINT `card_ibfk_1` FOREIGN KEY (`cust_jumin`) REFERENCES `customer` (`cust_jumin`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.card:~10 rows (대략적) 내보내기
DELETE FROM `card`;
INSERT INTO `card` (`card_no`, `cust_jumin`, `acc_id`, `card_register_date`, `card_limit_money`, `card_approve_date`, `card_type`) VALUES
	('2011-1001-1003', '790413-1234567', '1011-1001-1003', '2020-05-30', 5000000, '2020-06-25', 'check'),
	('2041-1001-1002', '890530-1234567', '1011-1001-1002', '2020-06-11', 3000000, '2020-06-15', 'check'),
	('2111-1001-1001', '760121-1234567', '1011-1001-1001', '2020-01-21', 1000000, '2020-02-10', 'check'),
	('2144-1001-1009', '891209-1234567', '1011-1001-1009', '2020-11-28', 1000000, '2020-12-10', 'check'),
	('2221-1001-1008', '920907-1234567', NULL, '2020-10-21', 5000000, '2020-11-15', 'credit'),
	('2345-1001-1007', '721128-1234567', '1011-1001-1007', '2020-06-15', 2000000, '2020-07-25', 'check'),
	('2611-1001-1005', '840615-1234567', '1011-1001-1005', '2020-09-12', 1500000, '2020-10-10', 'check'),
	('2711-1001-1004', '660912-1234567', NULL, '2020-04-13', 1000000, '2020-05-10', 'credit'),
	('2781-1001-1006', '651021-1234567', '1011-1001-1006', '2020-07-28', 10000000, '2020-08-15', 'check'),
	('2789-1001-1010', '770314-1234567', NULL, '2020-09-07', 1000000, '2020-10-10', 'credit');

-- 테이블 studydb.child 구조 내보내기
DROP TABLE IF EXISTS `child`;
CREATE TABLE IF NOT EXISTS `child` (
  `cid` varchar(10) NOT NULL,
  `name` varchar(10) DEFAULT NULL,
  `hp` char(13) DEFAULT NULL,
  `parent` varchar(10) DEFAULT NULL,
  PRIMARY KEY (`cid`),
  UNIQUE KEY `hp` (`hp`),
  KEY `parent` (`parent`),
  CONSTRAINT `child_ibfk_1` FOREIGN KEY (`parent`) REFERENCES `parent` (`pid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.child:~3 rows (대략적) 내보내기
DELETE FROM `child`;
INSERT INTO `child` (`cid`, `name`, `hp`, `parent`) VALUES
	('c101', '김철수', '010-1234-1001', 'p101'),
	('c102', '김영희', '010-1234-1002', 'p102'),
	('c103', '강철수', '010-1234-1003', 'p103');

-- 테이블 studydb.customer 구조 내보내기
DROP TABLE IF EXISTS `customer`;
CREATE TABLE IF NOT EXISTS `customer` (
  `cust_jumin` varchar(20) NOT NULL,
  `cust_name` varchar(20) NOT NULL,
  `cust_addr` varchar(100) NOT NULL,
  `cust_birth` date DEFAULT NULL,
  `cust_email` varchar(50) DEFAULT NULL,
  `cust_phnum` varchar(25) NOT NULL,
  `chst_job` varchar(30) DEFAULT NULL,
  PRIMARY KEY (`cust_jumin`),
  UNIQUE KEY `cust_email` (`cust_email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.customer:~11 rows (대략적) 내보내기
DELETE FROM `customer`;
INSERT INTO `customer` (`cust_jumin`, `cust_name`, `cust_addr`, `cust_birth`, `cust_email`, `cust_phnum`, `chst_job`) VALUES
	('651021-1234567', '김연아', '대구', '1965-10-21', 'yuna@daum.net', '010-5101-6510', '운동선수'),
	('660912-1234567', '원빈', '대전', '1966-09-12', 'one@naver.com', '010-2104-6609', '배우'),
	('721128-1234567', '유재석', '부산', '1972-11-28', NULL, '010-6101-7211', '개그맨'),
	('750611-1234567', '이정재', '서울', '1975-06-11', NULL, '010-1102-7506', '배우'),
	('760121-1234567', '정우성', '서울', '1976-01-21', NULL, '010-1101-7601', '배우'),
	('770314-1234567', '강동원', '광주', '1977-03-14', 'dong@naver.com', '010-8101-7703', '배우'),
	('790413-1234567', '이나영', '대전', '1979-04-13', 'lee@naver.com', '010-2101-7904', '회사원'),
	('790728-1234567', '장동건', '대구', '1979-07-28', 'jang@naver.com', '010-3101-7907', '배우'),
	('840615-1234567', '고소영', '대구', '1984-06-15', 'goso@daum.net', '010-4101-8406', '회사원'),
	('890530-1234567', '전지현', '대전', '1989-05-30', 'jjh@naver.com', '010-1103-8905', '자영업'),
	('891209-1234567', '조인성', '광주', '1989-12-09', 'join@gmail.com', '010-7104-8912', '배우'),
	('920907-1234567', '강호동', '부산', '1992-09-07', NULL, '010-7103-9209', '개그맨');

-- 테이블 studydb.department 구조 내보내기
DROP TABLE IF EXISTS `department`;
CREATE TABLE IF NOT EXISTS `department` (
  `depNo` tinyint NOT NULL,
  `name` varchar(10) NOT NULL,
  `tel` char(12) NOT NULL,
  PRIMARY KEY (`depNo`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.department:~7 rows (대략적) 내보내기
DELETE FROM `department`;
INSERT INTO `department` (`depNo`, `name`, `tel`) VALUES
	(101, '영업1부', '051-512-1001'),
	(102, '영업2부', '051-512-1002'),
	(103, '영업3부', '051-512-1003'),
	(104, '영업4부', '051-512-1004'),
	(105, '영업5부', '051-512-1005'),
	(106, '영업지원부', '051-512-1006'),
	(107, '인사부', '051-512-1007');

-- 테이블 studydb.filetest 구조 내보내기
DROP TABLE IF EXISTS `filetest`;
CREATE TABLE IF NOT EXISTS `filetest` (
  `fno` int NOT NULL AUTO_INCREMENT,
  `title` varchar(100) DEFAULT NULL,
  `oName` varchar(100) DEFAULT NULL,
  `sName` varchar(100) DEFAULT NULL,
  `rdate` datetime DEFAULT NULL,
  PRIMARY KEY (`fno`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.filetest:~2 rows (대략적) 내보내기
DELETE FROM `filetest`;
INSERT INTO `filetest` (`fno`, `title`, `oName`, `sName`, `rdate`) VALUES
	(4, '사과사과', 'html문서를 jsp로 변환방법.txt', '7e10462f-478c-4517-8742-4a9437f64470.txt', '2024-02-19 18:27:56');

-- 테이블 studydb.member 구조 내보내기
DROP TABLE IF EXISTS `member`;
CREATE TABLE IF NOT EXISTS `member` (
  `uid` varchar(10) NOT NULL,
  `name` varchar(10) NOT NULL,
  `hp` char(13) NOT NULL,
  `pos` varchar(10) DEFAULT '사원',
  `dep` tinyint DEFAULT NULL,
  `rdate` datetime NOT NULL,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `hp` (`hp`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.member:~12 rows (대략적) 내보내기
DELETE FROM `member`;
INSERT INTO `member` (`uid`, `name`, `hp`, `pos`, `dep`, `rdate`) VALUES
	('a101', '박혁거세', '010-1234-1001', '부장', 101, '2024-01-04 14:15:14'),
	('a102', '김유신', '010-1234-1002', '차장', 101, '2024-01-04 14:15:14'),
	('a103', '김춘추', '010-1234-1003', '사원', 101, '2024-01-04 14:15:14'),
	('a104', '장보고', '010-1234-1004', '대리', 102, '2024-01-04 14:15:14'),
	('a105', '강감찬', '010-1234-1005', '과장', 102, '2024-01-04 14:15:14'),
	('a106', '이성계', '010-1234-1006', '차장', 103, '2024-01-04 14:15:14'),
	('a107', '정철', '010-1234-1007', '차장', 103, '2024-01-04 14:15:14'),
	('a108', '이순신', '010-1234-1008', '부장', 104, '2024-01-04 14:15:14'),
	('a109', '허균', '010-1234-1009', '부장', 104, '2024-01-04 14:15:14'),
	('a110', '정약용', '010-1234-1010', '사원', 105, '2024-01-04 14:15:14'),
	('a111', '박지원', '010-1234-1011', '사원', 105, '2024-01-04 14:15:14'),
	('a112', '유관순', '010-1234-1012', '대리', 107, '2024-01-04 15:26:01'),
	('abc2', '홍동동', '010-6665-0111', '사원', 101, '2024-03-20 00:00:00');

-- 테이블 studydb.parent 구조 내보내기
DROP TABLE IF EXISTS `parent`;
CREATE TABLE IF NOT EXISTS `parent` (
  `pid` varchar(10) NOT NULL,
  `name` varchar(10) DEFAULT NULL,
  `birth` char(10) DEFAULT NULL,
  `addr` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`pid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.parent:~5 rows (대략적) 내보내기
DELETE FROM `parent`;
INSERT INTO `parent` (`pid`, `name`, `birth`, `addr`) VALUES
	('p101', '김유신', '1968-05-09', '경남 김해시'),
	('p102', '김춘추', '1968-05-09', '경남 김해시'),
	('p103', '장보고', '1968-05-09', '경남 김해시'),
	('p104', '강감찬', '1968-05-09', '경남 김해시'),
	('p105', '이순신', '1968-05-09', '경남 김해시');

-- 테이블 studydb.salary 구조 내보내기
DROP TABLE IF EXISTS `salary`;
CREATE TABLE IF NOT EXISTS `salary` (
  `uid` varchar(10) NOT NULL,
  `name` varchar(10) NOT NULL,
  `tim` varchar(15) NOT NULL,
  `dep` varchar(15) NOT NULL,
  `pos` varchar(10) NOT NULL DEFAULT '사원',
  `sal` int DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.salary:~7 rows (대략적) 내보내기
DELETE FROM `salary`;
INSERT INTO `salary` (`uid`, `name`, `tim`, `dep`, `pos`, `sal`) VALUES
	('K1501', '노준호', '영업3팀', '영업본부', '부장', 7080000),
	('K1509', '박소윤', '영업2팀', '영업본부', '차장', 6420000),
	('K1510', '남주희', '영업3팀', '영업본부', '차장', 6250000),
	('K1513', '김정인', '품질경영팀', '생산본부', '차장', 5940000),
	('K1521', '박해미', '영업1팀', '영업본부', '대리', 4330000),
	('K1533', '이상윤', '회계팀', '경영지원본부', '사원', 3630000);

-- 테이블 studydb.sales 구조 내보내기
DROP TABLE IF EXISTS `sales`;
CREATE TABLE IF NOT EXISTS `sales` (
  `seq` int NOT NULL AUTO_INCREMENT,
  `uid` varchar(10) NOT NULL,
  `year` year NOT NULL,
  `month` tinyint NOT NULL,
  `sale` int NOT NULL,
  PRIMARY KEY (`seq`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.sales:~30 rows (대략적) 내보내기
DELETE FROM `sales`;
INSERT INTO `sales` (`seq`, `uid`, `year`, `month`, `sale`) VALUES
	(1, 'a101', '2018', 1, 98100),
	(2, 'a102', '2018', 1, 136000),
	(3, 'a103', '2018', 1, 80100),
	(4, 'a104', '2018', 1, 78000),
	(5, 'a105', '2018', 1, 93000),
	(6, 'a101', '2018', 2, 23500),
	(7, 'a102', '2018', 2, 126000),
	(8, 'a103', '2018', 2, 18500),
	(9, 'a105', '2018', 2, 19000),
	(10, 'a106', '2018', 2, 53000),
	(11, 'a101', '2019', 1, 24000),
	(12, 'a102', '2019', 1, 109000),
	(13, 'a103', '2019', 1, 101000),
	(14, 'a104', '2019', 1, 53500),
	(15, 'a107', '2019', 1, 24000),
	(16, 'a102', '2019', 2, 160000),
	(17, 'a103', '2019', 2, 101000),
	(18, 'a104', '2019', 2, 43000),
	(19, 'a105', '2019', 2, 24000),
	(20, 'a106', '2019', 2, 109000),
	(21, 'a102', '2020', 1, 201000),
	(22, 'a104', '2020', 1, 63000),
	(23, 'a105', '2020', 1, 74000),
	(24, 'a106', '2020', 1, 122000),
	(25, 'a107', '2020', 1, 111000),
	(26, 'a102', '2020', 2, 120000),
	(27, 'a103', '2020', 2, 93000),
	(28, 'a104', '2020', 2, 84000),
	(29, 'a105', '2020', 2, 180000),
	(30, 'a108', '2020', 2, 76000);

-- 테이블 studydb.sales2 구조 내보내기
DROP TABLE IF EXISTS `sales2`;
CREATE TABLE IF NOT EXISTS `sales2` (
  `seq` int NOT NULL AUTO_INCREMENT,
  `uid` varchar(10) NOT NULL,
  `year` year NOT NULL,
  `month` tinyint NOT NULL,
  `sale` int NOT NULL,
  PRIMARY KEY (`seq`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.sales2:~30 rows (대략적) 내보내기
DELETE FROM `sales2`;
INSERT INTO `sales2` (`seq`, `uid`, `year`, `month`, `sale`) VALUES
	(1, 'a101', '2021', 1, 98100),
	(2, 'a102', '2021', 1, 136000),
	(3, 'a103', '2021', 1, 80100),
	(4, 'a104', '2021', 1, 78000),
	(5, 'a105', '2021', 1, 93000),
	(6, 'a101', '2021', 2, 23500),
	(7, 'a102', '2021', 2, 126000),
	(8, 'a103', '2021', 2, 18500),
	(9, 'a105', '2021', 2, 19000),
	(10, 'a106', '2021', 2, 53000),
	(11, 'a101', '2022', 1, 24000),
	(12, 'a102', '2022', 1, 109000),
	(13, 'a103', '2022', 1, 101000),
	(14, 'a104', '2022', 1, 53500),
	(15, 'a107', '2022', 1, 24000),
	(16, 'a102', '2022', 2, 160000),
	(17, 'a103', '2022', 2, 101000),
	(18, 'a104', '2022', 2, 43000),
	(19, 'a105', '2022', 2, 24000),
	(20, 'a106', '2022', 2, 109000),
	(21, 'a102', '2023', 1, 201000),
	(22, 'a104', '2023', 1, 63000),
	(23, 'a105', '2023', 1, 74000),
	(24, 'a106', '2023', 1, 122000),
	(25, 'a107', '2023', 1, 111000),
	(26, 'a102', '2023', 2, 120000),
	(27, 'a103', '2023', 2, 93000),
	(28, 'a104', '2023', 2, 84000),
	(29, 'a105', '2023', 2, 180000),
	(30, 'a108', '2023', 2, 76000);

-- 테이블 studydb.shop_customer 구조 내보내기
DROP TABLE IF EXISTS `shop_customer`;
CREATE TABLE IF NOT EXISTS `shop_customer` (
  `age` int NOT NULL,
  `regDate` datetime(6) DEFAULT NULL,
  `addr` varchar(255) DEFAULT NULL,
  `custId` varchar(255) NOT NULL,
  `hp` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`custId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.shop_customer:~5 rows (대략적) 내보내기
DELETE FROM `shop_customer`;
INSERT INTO `shop_customer` (`age`, `regDate`, `addr`, `custId`, `hp`, `name`) VALUES
	(23, '2024-03-12 17:07:46.000000', '서울', 'a101', '010-1234-1001', '김유신'),
	(21, '2024-03-12 17:07:48.000000', '대전', 'a102', '010-1234-1002', '김춘추'),
	(31, '2024-03-12 17:07:51.000000', '대구', 'a103', '010-1234-1003', '장보고'),
	(41, '2024-03-12 17:07:53.000000', '부산', 'a104', '010-1234-1004', '강감찬'),
	(51, '2024-03-12 17:07:55.000000', '광주', 'a105', '010-1234-1005', '이순신');

-- 테이블 studydb.shop_order 구조 내보내기
DROP TABLE IF EXISTS `shop_order`;
CREATE TABLE IF NOT EXISTS `shop_order` (
  `orderId` int NOT NULL AUTO_INCREMENT,
  `orderPrice` int NOT NULL,
  `orderStatus` int NOT NULL,
  `orderDate` datetime(6) DEFAULT NULL,
  `orderer` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`orderId`),
  KEY `FKqn6qdr7k6dnb3qe1u8xq95p0f` (`orderer`),
  CONSTRAINT `FKqn6qdr7k6dnb3qe1u8xq95p0f` FOREIGN KEY (`orderer`) REFERENCES `shop_customer` (`custId`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.shop_order:~5 rows (대략적) 내보내기
DELETE FROM `shop_order`;
INSERT INTO `shop_order` (`orderId`, `orderPrice`, `orderStatus`, `orderDate`, `orderer`) VALUES
	(1, 15000, 1, '2024-03-12 17:08:13.000000', 'a101'),
	(2, 35000, 1, '2024-03-12 17:08:15.000000', 'a102'),
	(3, 800000, 1, '2024-03-12 17:08:18.000000', 'a103'),
	(4, 235000, 1, '2024-03-12 17:08:19.000000', 'a105'),
	(5, 35000, 1, '2024-03-12 17:08:21.000000', 'a102');

-- 테이블 studydb.shop_order_item 구조 내보내기
DROP TABLE IF EXISTS `shop_order_item`;
CREATE TABLE IF NOT EXISTS `shop_order_item` (
  `count` int NOT NULL,
  `orderId` int DEFAULT NULL,
  `orderItemId` int NOT NULL AUTO_INCREMENT,
  `productId` int DEFAULT NULL,
  PRIMARY KEY (`orderItemId`),
  KEY `FK8uiril3a4wmy7rdaw8d6j2v38` (`orderId`),
  KEY `FK5rp0yud1ws22yhp7rtwsho3r1` (`productId`),
  CONSTRAINT `FK5rp0yud1ws22yhp7rtwsho3r1` FOREIGN KEY (`productId`) REFERENCES `shop_product` (`productId`),
  CONSTRAINT `FK8uiril3a4wmy7rdaw8d6j2v38` FOREIGN KEY (`orderId`) REFERENCES `shop_order` (`orderId`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.shop_order_item:~6 rows (대략적) 내보내기
DELETE FROM `shop_order_item`;
INSERT INTO `shop_order_item` (`count`, `orderId`, `orderItemId`, `productId`) VALUES
	(3, 1, 1, 2),
	(2, 2, 2, 1),
	(1, 3, 3, 4),
	(1, 4, 4, 5),
	(1, 3, 5, 1),
	(2, 5, 6, 2);

-- 테이블 studydb.shop_product 구조 내보내기
DROP TABLE IF EXISTS `shop_product`;
CREATE TABLE IF NOT EXISTS `shop_product` (
  `price` int NOT NULL,
  `productId` int NOT NULL AUTO_INCREMENT,
  `stock` int NOT NULL,
  `productName` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`productId`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.shop_product:~5 rows (대략적) 내보내기
DELETE FROM `shop_product`;
INSERT INTO `shop_product` (`price`, `productId`, `stock`, `productName`) VALUES
	(35000, 1, 100, '키보드'),
	(15000, 2, 100, '마우스'),
	(1200000, 3, 100, '노트북'),
	(800000, 4, 100, '휴대폰'),
	(235000, 5, 100, '모니터');

-- 테이블 studydb.sqld1 구조 내보내기
DROP TABLE IF EXISTS `sqld1`;
CREATE TABLE IF NOT EXISTS `sqld1` (
  `col1` varchar(30) DEFAULT NULL,
  `col2` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.sqld1:~4 rows (대략적) 내보내기
DELETE FROM `sqld1`;
INSERT INTO `sqld1` (`col1`, `col2`) VALUES
	('1', 20),
	('2', 30),
	('3', 40),
	('A', 50);

-- 테이블 studydb.sqld2 구조 내보내기
DROP TABLE IF EXISTS `sqld2`;
CREATE TABLE IF NOT EXISTS `sqld2` (
  `col1` varchar(30) DEFAULT NULL,
  `col3` varchar(30) DEFAULT NULL,
  `col4` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.sqld2:~4 rows (대략적) 내보내기
DELETE FROM `sqld2`;
INSERT INTO `sqld2` (`col1`, `col3`, `col4`) VALUES
	('1', 'ABC', 10),
	('2', 'DEF', 9),
	('3', 'XY', 15),
	('A', '1', 5),
	('A', '2', NULL);

-- 테이블 studydb.sqld3 구조 내보내기
DROP TABLE IF EXISTS `sqld3`;
CREATE TABLE IF NOT EXISTS `sqld3` (
  `col4` int NOT NULL,
  `col5` varchar(30) DEFAULT NULL,
  PRIMARY KEY (`col4`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.sqld3:~4 rows (대략적) 내보내기
DELETE FROM `sqld3`;
INSERT INTO `sqld3` (`col4`, `col5`) VALUES
	(5, 'D'),
	(9, 'B'),
	(10, 'A'),
	(15, 'C');

-- 테이블 studydb.sub 구조 내보내기
DROP TABLE IF EXISTS `sub`;
CREATE TABLE IF NOT EXISTS `sub` (
  `col1` varchar(30) DEFAULT NULL,
  `col2` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.sub:~6 rows (대략적) 내보내기
DELETE FROM `sub`;
INSERT INTO `sub` (`col1`, `col2`) VALUES
	('Y', 20),
	('X', 30),
	('A', 40),
	('A', 50),
	(NULL, 10),
	(NULL, 80);

-- 테이블 studydb.tblproduct 구조 내보내기
DROP TABLE IF EXISTS `tblproduct`;
CREATE TABLE IF NOT EXISTS `tblproduct` (
  `prod_no` varchar(10) DEFAULT NULL,
  `prod_name` varchar(10) DEFAULT NULL,
  `prod_price` char(13) DEFAULT NULL,
  `prod_stock` int DEFAULT NULL,
  `prod_company` varchar(13) DEFAULT NULL,
  `PROD_DATE` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.tblproduct:~4 rows (대략적) 내보내기
DELETE FROM `tblproduct`;
INSERT INTO `tblproduct` (`prod_no`, `prod_name`, `prod_price`, `prod_stock`, `prod_company`, `PROD_DATE`) VALUES
	('1001', '냉장고', '800,000', 120, 'LG전자', '2002-01-06'),
	('1001', '냉장고', '800,000', 120, 'LG전자', '2002-01-06'),
	('1001', '냉장고', '800,000', 120, 'LG전자', '2022-01-06'),
	('1001', '냉장고', '800,000', 120, 'LG전자', '2022-01-06');

-- 테이블 studydb.tbluser 구조 내보내기
DROP TABLE IF EXISTS `tbluser`;
CREATE TABLE IF NOT EXISTS `tbluser` (
  `user_id` varchar(10) DEFAULT NULL,
  `user_name` varchar(10) DEFAULT NULL,
  `user_hp` char(13) DEFAULT NULL,
  `user_age` int DEFAULT NULL,
  `user_addr` varchar(13) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.tbluser:~5 rows (대략적) 내보내기
DELETE FROM `tbluser`;
INSERT INTO `tbluser` (`user_id`, `user_name`, `user_hp`, `user_age`, `user_addr`) VALUES
	('p101', '김유신', '010-1234-1001', 25, '경남 김해시'),
	('p102', '김춘추', '010-1234-1002', 23, '경남 경주시'),
	('p104', '강감찬', NULL, NULL, '서울시 중구'),
	('p105', '이순신', '010-1234-1005', 50, NULL),
	('p105', '이순신', '010-1234-1005', 50, NULL);

-- 테이블 studydb.test 구조 내보내기
DROP TABLE IF EXISTS `test`;
CREATE TABLE IF NOT EXISTS `test` (
  `col1` varchar(30) DEFAULT NULL,
  `col2` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.test:~4 rows (대략적) 내보내기
DELETE FROM `test`;
INSERT INTO `test` (`col1`, `col2`) VALUES
	('1', 100),
	('1', NULL),
	('2', 100),
	('2', 200);

-- 테이블 studydb.test1 구조 내보내기
DROP TABLE IF EXISTS `test1`;
CREATE TABLE IF NOT EXISTS `test1` (
  `uid` varchar(10) NOT NULL,
  `user_name` varchar(10) DEFAULT NULL,
  `user_hp` varchar(13) DEFAULT NULL,
  `user_age` int DEFAULT NULL,
  `user_addr` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `user_hp` (`user_hp`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.test1:~5 rows (대략적) 내보내기
DELETE FROM `test1`;
INSERT INTO `test1` (`uid`, `user_name`, `user_hp`, `user_age`, `user_addr`) VALUES
	('p101', '김유신', '010-1234-1001', 25, '경남 김해시'),
	('p102', '김춘추', '010-1234-1002', 23, '경남 경주시'),
	('p103', '장보고', NULL, 31, '전남 완도군'),
	('p104', '강감찬', NULL, NULL, '서울시 중구'),
	('p105', '이순신', '010-1234-1005', 50, '부산시 해운대구');

-- 테이블 studydb.transaction 구조 내보내기
DROP TABLE IF EXISTS `transaction`;
CREATE TABLE IF NOT EXISTS `transaction` (
  `trans_id` int NOT NULL AUTO_INCREMENT,
  `acc_id` char(14) DEFAULT NULL,
  `trans_type` varchar(20) DEFAULT NULL,
  `trans_message` varchar(50) DEFAULT NULL,
  `trans_money` int DEFAULT NULL,
  `trans_date` datetime DEFAULT NULL,
  PRIMARY KEY (`trans_id`),
  KEY `acc_id` (`acc_id`),
  CONSTRAINT `transaction_ibfk_1` FOREIGN KEY (`acc_id`) REFERENCES `account` (`acc_id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.transaction:~10 rows (대략적) 내보내기
DELETE FROM `transaction`;
INSERT INTO `transaction` (`trans_id`, `acc_id`, `trans_type`, `trans_message`, `trans_money`, `trans_date`) VALUES
	(1, '1011-1001-1001', '입금', '2월 정기급여', 3500000, '2020-02-10 00:00:00'),
	(2, '1011-1001-1003', '출금', 'ATM출금', 300000, '2020-02-10 00:00:00'),
	(3, '1011-1001-1002', '입금', '2월 급여', 2800000, '2020-02-10 00:00:00'),
	(4, '1011-1001-1007', '출금', '2월 공과금', 116200, '2020-02-10 00:00:00'),
	(5, '1011-1001-1005', '출금', 'ATM출금', 50000, '2020-02-10 00:00:00'),
	(6, '1011-1001-1007', '입금', '홍길동 이체', 400000, '2020-02-10 00:00:00'),
	(7, '1011-1001-1007', '출금', '2월 관리비', 145000, '2020-02-10 00:00:00'),
	(8, '1011-1001-1002', '입금', '홍길동 입금', 200000, '2020-02-10 00:00:00'),
	(9, '1011-1001-1009', '입금', '연말정산 환급', 112000, '2020-02-10 00:00:00'),
	(10, '1011-1001-1006', '출금', 'ATM출금', 30000, '2020-02-10 00:00:00');

-- 테이블 studydb.user 구조 내보내기
DROP TABLE IF EXISTS `user`;
CREATE TABLE IF NOT EXISTS `user` (
  `uid` varchar(255) NOT NULL,
  `age` int NOT NULL,
  `hp` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `pass` varchar(255) DEFAULT NULL,
  `regDate` datetime(6) DEFAULT NULL,
  `role` varchar(255) DEFAULT NULL,
  `provider` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.user:~4 rows (대략적) 내보내기
DELETE FROM `user`;
INSERT INTO `user` (`uid`, `age`, `hp`, `name`, `pass`, `regDate`, `role`, `provider`) VALUES
	('a101', 21, '010-1234-1001', '김유신', '$2a$10$LVnAbE5bVRFOKJsnmiiUBOJiuyBLObSUu8Dkl/IbJbIYrBSBXDx6O', '2024-03-13 11:23:56.976039', NULL, NULL),
	('a102', 23, '010-1111-1122', '동동이', '$2a$10$2TIVHldRSnaOCwOPiaa52edjjBuwOFThnTmbcHCTzrg9Yw/wZk/2K', '2024-03-13 11:31:36.166986', 'ADMIN', NULL),
	('a103', 20, '010-4567-1234', '매닐저', '$2a$10$mpV6ihA8WorLaKeCg2T2uOK6feMa0Jjay5gcHytSaFR1L4flO7ISC', '2024-03-13 11:32:03.787511', 'MANAGER', NULL),
	('a104', 50, '010-1234-7777', '유절', '$2a$10$fbnOONAV.rrv6yWQ/8aETuY35n4x/dyXH2lRoIcSLOwaZKK4E00vG', '2024-03-13 11:32:29.963478', 'USER', NULL);

-- 테이블 studydb.user1 구조 내보내기
DROP TABLE IF EXISTS `user1`;
CREATE TABLE IF NOT EXISTS `user1` (
  `age` int DEFAULT NULL,
  `birth` varchar(255) DEFAULT NULL,
  `hp` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `uid` varchar(255) NOT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.user1:~4 rows (대략적) 내보내기
DELETE FROM `user1`;
INSERT INTO `user1` (`age`, `birth`, `hp`, `name`, `uid`) VALUES
	(22, '1992-01-01', '010-6655-7788', '동동', 'a101'),
	(11, '2024-03-12', '010-4234-4752', '동동동', 'a102'),
	(19, '2024-03-12', '010-6665-0111', '이순신', 'a103');

-- 테이블 studydb.user2 구조 내보내기
DROP TABLE IF EXISTS `user2`;
CREATE TABLE IF NOT EXISTS `user2` (
  `addr` varchar(255) DEFAULT NULL,
  `birth` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `uid` varchar(255) NOT NULL,
  `age` int NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.user2:~5 rows (대략적) 내보내기
DELETE FROM `user2`;
INSERT INTO `user2` (`addr`, `birth`, `name`, `uid`, `age`, `email`) VALUES
	('해운대', '1995-01-01', '이이랑', 'a101', 0, 'oor92@naver.com'),
	('파랑시', '1991-05-05', '김추추', 'a102', 0, NULL),
	('주황시', '1991-05-01', '김추', 'a103', 0, NULL),
	('해운대', '2024-03-12', '오아람', 'a104', 22, 'oor92@ladjl'),
	('부산 해운대', '2024-03-25', '송송이', 'a105', 22, 'oor92@naver.com');

-- 테이블 studydb.user3 구조 내보내기
DROP TABLE IF EXISTS `user3`;
CREATE TABLE IF NOT EXISTS `user3` (
  `addr` varchar(255) DEFAULT NULL,
  `birth` varchar(255) DEFAULT NULL,
  `hp` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `uid` varchar(255) NOT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.user3:~1 rows (대략적) 내보내기
DELETE FROM `user3`;
INSERT INTO `user3` (`addr`, `birth`, `hp`, `name`, `uid`) VALUES
	('경주시시', '1990-11-16', '010-5559-1235', '김수리리', 'a101'),
	('해운대', '2024-03-20', '010-7894-4567', '홍동동', 'a102');

-- 테이블 studydb.user4 구조 내보내기
DROP TABLE IF EXISTS `user4`;
CREATE TABLE IF NOT EXISTS `user4` (
  `uid` varchar(10) NOT NULL,
  `name` varchar(10) NOT NULL,
  `gender` varchar(255) DEFAULT NULL,
  `age` varchar(255) DEFAULT NULL,
  `hp` varchar(255) DEFAULT NULL,
  `addr` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `hp` (`hp`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.user4:~5 rows (대략적) 내보내기
DELETE FROM `user4`;
INSERT INTO `user4` (`uid`, `name`, `gender`, `age`, `hp`, `addr`) VALUES
	('A101', '김유신', 'M', '25', '010-1234-1111', '경남 깅해시'),
	('A102', '김춘추', 'M', '23', '010-1234-2222', '경남 경주시'),
	('A103', '장보고', 'M', '35', '010-1234-3333', '전남 완도군'),
	('A104', '강감찬', 'M', '42', '010-1234-4445', '서울시 관악구'),
	('a105', '김춘영', 'F', '21', '010-5555-9999', '서울'),
	('abc1234', '홍동동', '남', '20', '010-6655-7788', '부산');

-- 테이블 studydb.user5 구조 내보내기
DROP TABLE IF EXISTS `user5`;
CREATE TABLE IF NOT EXISTS `user5` (
  `seq` int NOT NULL AUTO_INCREMENT,
  `name` varchar(10) NOT NULL,
  `gender` varchar(255) DEFAULT NULL,
  `age` varchar(255) DEFAULT NULL,
  `addr` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`seq`),
  CONSTRAINT `user5_chk_1` CHECK ((`gender` in (_utf8mb4'M',_utf8mb4'F'))),
  CONSTRAINT `user5_chk_2` CHECK (((`age` > 0) and (`age` < 100)))
) ENGINE=InnoDB AUTO_INCREMENT=42 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 studydb.user5:~18 rows (대략적) 내보내기
DELETE FROM `user5`;
INSERT INTO `user5` (`seq`, `name`, `gender`, `age`, `addr`) VALUES
	(1, '김유신', 'M', '25', '경남 김해시'),
	(2, '김춘추', 'M', '23', '경남 경주시'),
	(3, '장보고', 'M', '35', '전남 완도군'),
	(4, '강감찬', 'M', '42', '서울시 관악구'),
	(5, '이순신', 'M', '51', '부산시'),
	(6, '신사임당', 'F', '23', '강릉시'),
	(21, '고춘영', 'F', '23', '강남'),
	(22, '고춘희', 'M', '2', '4동'),
	(24, '고영희', 'F', '20', '경상도'),
	(33, '고춘희', 'M', '25', '서동'),
	(34, '고춘희', 'M', '25', '서동'),
	(35, '고춘희', 'M', '25', '서동'),
	(36, 'asdf', 'M', '22', '2121'),
	(37, 'sfdsafsa', 'M', '22', '부산 해운대 반여'),
	(38, 'sdaf2323', 'M', '22', 'deereefe'),
	(39, 'dsfds', 'F', '22', 'dsafaef212'),
	(40, 'sdafsd', 'M', '23', 'sdaafeer3243'),
	(41, 'abcd123', 'M', '22', '2121');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
